{
    "courses": [
        {
            "course_code": "ADM120",
            "name": "Marketing",
            "learning_outcomes": "Knowledge:\nBy the end of the course students will:\nHave knowledge and understanding of essential principles of marketing.\nHave an in-depth understanding of how a firm can achieve competitiveness through the design and implementation of market-responsive programmes\nSkills:\nBy the end of the course students will:\nBe able to understand the principles of marketing management, planning and strategy\nBe able to evaluate the marketing function and the role it plays in achieving organisational success\nBe able to utilise information of a firm's external and internal environment to develop appropriate marketing strategies\nBe able to apply theoretical frameworks to real-world marketing situations\nGeneral competence:\nCompetence relevant to the needs of existing and future managers, such as develop factually supported arguments in oral and written communication.\nIdentify and analyse problems and create processes to solve them\nCompetence to identify and analyse ethical, social, environmental, and cultural dilemmas in marketing.",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n100%\nDuration:\n2 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nOnly general dictionary in mother tongue/Norwegian/English in paper version",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "None"
        },
        {
            "course_code": "ADM715",
            "name": "Essentials in organization and management",
            "learning_outcomes": "Upon finishing the course students should have knowledge of essential debates in the field of organization and management science and be able to relate these to key management and organization concepts. Based on this insight, students are expected to make their independent analyses of organization and management designs, systems and processes",
            "exam_format": "Form of assessment: Open home exam + school exam.\nProportion: 100%\nDuration school exam: 6 hours. The home exam is to be submitted the same day as the school exam.\nGruppering: Individuell\nGrading scale: Letter (A - F)\nSupported material: Own notes",
            "mandatory_assignments": "75 % presence in seminars. Attendance can be replaced with a passed special assignment. This must be approved to get access to final school exam\nComment: Mandatory coursework must be completed in the same semester as the course is taught, and then gives access to the ordinary exam. Approved course work also give access to the first \"New and retake exam\" if such an exam is arranged. The mandatory course work may not be valid in the future. This means that students who take the course again normally must do the mandatory course work again.",
            "recommended_requirements": "Key concepts in sport management by Terri Byers, is mandatory for Sports Management students. It is preferable to have read it before the course starts."
        },
        {
            "course_code": "ADM722",
            "name": "Global change and organizations",
            "learning_outcomes": "General knowledge\nAfter completing the course, the student will acquire the following knowledge:\nA comprehensive understanding of various global trends and developments.\nAn ability to understand the challenges and opportunities public and private organizations face in today's changing global environment.\nSkill\nAfter completing the course, the student will acquire the following skills:\nCritical thinking and analytical skills within the topic.\nParticipating in discussions, analyzing case studies, and applying real-world examples to understand the complexities of the global processes.\nBeing able to assess and evaluate the strengths and weaknesses of different approaches to understanding global changes.\nCompetence\nAfter completing the course, the student will acquire the following competences:\nBeing able to navigate through the complexity of the global trends and their relations to public and private organizations, and citizens.\nApplying critical thinking to plan and implement projects in line with requirements for truthfulness, accuracy and ethics in scientific writing.",
            "exam_format": "Form of assessment: Digital School Exam\nProportion: 100 %\nDuration: 5 hours\nGrading scale: Letter (A - F)\nSupport material: Dictionary",
            "mandatory_assignments": "Presentation (pass/fail)\n75 % presence in class.\nComment: Mandatory coursework must be completed in the same semester as the course is taught, and then gives access to the ordinary exam. Approved course work also give access to the first \"New and retake exam\" if such an exam is arranged. The mandatory course work is no longer valid in the future. This means that students who take the course again must do the mandatory course work again.",
            "recommended_requirements": "ADM530 Globale studier; SAF230 International Politics"
        },
        {
            "course_code": "ADM735",
            "name": "International Marketing",
            "learning_outcomes": "Knowledge:\nHave an in-depth understanding of how a firm can achieve global competitiveness through the design and implementation of market-responsive programs\nHave acquired both knowledge and know-how to develop and implement global marketing plans\nSkills:\nBe able to critically evaluate key international marketing concepts, theory and practice;\nBe able to critically evaluate a firm's international marketing strategy and marketing mix decisions;\nBe able to apply theoretical frameworks to real-world marketing situations\nGeneral competence:\nCompetence relevant to the needs of existing and future managers, executives and professionals, regardless of their sector of operation. These will include analysis and synthesis, oral and written communication.\nCan demonstrate his/her learning and problem solving abilities in new areas to carry out assignments and projects\nCompetence to identify and analyze ethical dilemmas in international marketing.",
            "exam_format": "Form of assessment:\nHome assessment\nProportion:\n%\nDuration:\nsemester\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\n-\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:55 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Bachelor of Economics and Administration or Bachelor of Accounting and Auditing or equivalent"
        },
        {
            "course_code": "ADM740",
            "name": "International Business",
            "learning_outcomes": "Knowledge:\nBy the end of the course students will:\nHave an in-depth understanding of the nature of international business and the impact of globalisation.\nHave acquired knowledge into strategic and operational challenges businesses may face in an international context.​\nSkills:\nBy the end of the course students will:\nBe able to identify the principal actors that have shaped the international business environment\nBe able to identify and explain the major challenges confronting international business firms\nBe able to analyze the strategies employed in the global business environment\nGeneral competence:\nCompetence relevant to the needs of existing and future managers, executives, and professionals. These will include analysis and synthesis, oral and written communication.\nCan demonstrate his/her learning and problem-solving abilities to carry out assignments and projects\nCompetence to reflect on ethical dilemmas in international business.",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n%\nDuration:\n2 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\n-\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:55 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Bachelor of Economics and Administration or Bachelor of Accounting and Auditing or equivalent"
        },
        {
            "course_code": "ADM825-001",
            "name": "Special Issues in Organization and Management",
            "learning_outcomes": "Not specified",
            "exam_format": "Three hour written school exam end of week (Friday). The exam starts at noon.\nSupporting materials are lecture notes and own notes (printed, not digital)\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:48 PM",
            "mandatory_assignments": "50 % class attendance is mandatory.",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "ADM825-002",
            "name": "Special Issues in Organization and Management",
            "learning_outcomes": "Not specified",
            "exam_format": "Three hour written exam end of week (Friday). The exam starts at noon.\nSupporting materials are lecture notes and own notes (printed, not digital)\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:48 PM",
            "mandatory_assignments": "50 % class attendance is mandatory.",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "ADM825-003",
            "name": "Special Issues in Organization and Management",
            "learning_outcomes": "Not specified",
            "exam_format": "Three hour written exam end of week (Friday). The exam starts at noon.\nSupporting materials are lecture notes and own notes (printed, not digital)\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:48 PM",
            "mandatory_assignments": "50 % class attendance is mandatory.",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "ADM825-004",
            "name": "Special Issues in Organization and Management",
            "learning_outcomes": "Not specified",
            "exam_format": "Normally, three hour written exam end of week (Friday). The exam starts at noon. Supporting materials are lecture notes and own notes (printed, not digital)\nExceptions may apply\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:48 PM",
            "mandatory_assignments": "50 % class attendance is mandatory.",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "ADM825-005",
            "name": "Special Issues in Organization and Management",
            "learning_outcomes": "Not specified",
            "exam_format": "Three hour written exam end of week (Friday). The exam starts at noon. Supporting materials are lecture notes and own notes (printed, not digital)\nExceptions may apply\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:48 PM",
            "mandatory_assignments": "50 % class attendance is mandatory.",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "ADM825-006",
            "name": "Special Issues in Organization and Management",
            "learning_outcomes": "Not specified",
            "exam_format": "Three hour written exam end of week (Friday). The exam starts at noon.\nSupporting materials are lecture notes and own notes (analogue/printed)\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:49 PM",
            "mandatory_assignments": "50 % class attendance is mandatory",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "ADM910",
            "name": "Theory and Philosophy of Social Science",
            "learning_outcomes": "Knowledge\nAfter completing the course, the student will acquire the following knowledge:\nIn-depth understanding of key concepts and debates in philosophy of science and methodology.\nAdvanced knowledge of key social theorists, their ideas, and methodological approaches.\nAdvanced knowledge of philosophical perspectives on social reality, scientific explanation and the interplay between individual action and social structures.\nSkills\nAfter completing the course, the student will acquire the following skills:\nCritical assessment skills to evaluate arguments in philosophy of social science and social theory.\nAbility to critically reflect on the underlying concepts and assumptions that shape social science research.\nProficiency in analyzing the implications of various philosophical perspectives in social science research.\nCompetence\nAfter completing the course, the student will acquire the following competences:\nCritical thinking skills to approach the social world and pose relevant questions for conducting social inquiry.\nProficiency in using various forms of scientific explanation and methodology.\nStrong communication skills to discuss academic issues in class, as well as express themselves through written assignments and other academic activities.",
            "exam_format": "Form of assessment: Digital school examination\nProportion: 100 %\nDuration: 5 hours\nGrading scale: Letter (A - F)\nSupporting materials: Dictionary",
            "mandatory_assignments": "Presentation\n75 % presence in class is required to qualify for final exam.\nComment: Mandatory coursework must be completed in the same semester as the course is taught, and then gives access to the ordinary exam. Approved course work also give access to the first \"New and retake exam\" if such an exam is arranged. The mandatory course work is no longer valid in the future. This means that students who take the course again must do the mandatory course work again.",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "BØK705",
            "name": "Investment Analysis",
            "learning_outcomes": "The purpose of the course is to expand the students knowledge of asset pricing and corporate finance. Arbitrage pricing theory and game theory are two new concepts that are introduced at the master's level. We apply the arbitrage pricing theory to both financial investments and real investments. We use game theoretic models with asymmetric information to understand conflicts of interest between owners, creditors, and management. A successful student should be able to use the course content to value financial assets and real assets, and be able to analyze financing decisions in situations with asymmetric information.\nKnowledge after the course:\nunderstand how risk and return affect savings and investments\nunderstand and be able to apply the capital asset pricing theory to calculate the opportunity cost of capital\nunderstand and be able to arbitragearguments for valuation of both financial and real assets\nunderstand and be able to analyze the costs and benefits of debtfinancing of a corporation\nunderstand how the dividendpolicy affect stock prices\nunderstand how asymmetric information may create conflicts of interests between owners and creditors, between owners and management, and how these conflicts may be resolved\nunderstand how the market for corporate control works\nunderstand how mergers and acqusitions may be value creating and value reducing",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n100%\nDuration:\n6 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nCalculator with empty memory + general dictionary in mother tongue/Norwegian/English in paper version",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Bachelor's degree in Economics and Business Administration\nIn particular a bachelor's course in investments and financing (BØK300 at Molde University College)."
        },
        {
            "course_code": "BØK730",
            "name": "Econometrics",
            "learning_outcomes": "Knowledge\nAfter completing the course, students should have skills and knowledge in statistical methodology constituting a base from which they can successfully carry out solid empirical work, e.g., in their master thesis or later in their academic or professional careers. Specifically, the students should be able to:\nconfidently perform estimation and testing of hypotheses about main population parameters such as means, proportions, variances\nspecify and estimate linear regression models, using appropriate theory and sample data\nidentify and handle nonlinear effects in regression models using transformations and dummy variables\nidentify and handle heteroscedasticity, multicollinearity and autocorrelation in regression data\nemploy binary response and limited dependent variable models in cases where the outcome is not continuous\nwork with basic time series models and do forecasting with moving averages, exponential smoothing\nuse panel data methods for continuous, binary and ordered responses\ninterpret the result of statistical analyses and explain the results in nontechnical language\nSkills\nIt is expected that the students will:\nbe able to apply modern computer programs in regression analyses of empirical data, including statistical testing to investigate whether the classical assumptions in regression analysis are satisfied\nbe a qualified user of basic econometric methods\nperform be a critical reader of the literature concerning empirical analyses\nbe able to perform statistical analysis using the statistical package Stata\nCompetence\nFurthermore, the students should:\nbe able to read and understand project reports and journal articles that make use of the concepts and methods that are introduced in the course\nbe able to make use of econometric models in their own academic work, for example in analyses needed for their master’s thesis",
            "exam_format": "Vurderingsform:\nDigital skoleeksamen - Inspera\nAndel:\n100%\nVarighet:\n4 timer\nGruppering:\nIndividuell\nKarakterskala:\nBokstavkarakter (A - F)\nHjelpemidler:",
            "mandatory_assignments": "Obligatorisk arbeidskrav:\nOppgave(r)\nAntall arbeidskrav:\n2\nPåkrevde arbeidskrav:\n2\nFremmøte:\nIkke påkrevd\nKommentar:\nThere will be two mandatory assignments. Both need to be passed to take the final exam.",
            "recommended_requirements": "Background knowledge in statistics"
        },
        {
            "course_code": "BØK750",
            "name": "Decision and Game Theory",
            "learning_outcomes": "Knowledge\nUpon completion of the course, students will have:\nsolid knowledge of theories and principles for analysis of decision making under uncertainty and under strategic interaction.\nSkills\nUpon completion of the course, students will be able to:\napply economic analysis to understand decision making under uncertainty and strategic interaction\napply game theoretic methods to understand behavior and outcomes in situations where agents have different objectives, action possibilities and information\nGeneral competence\nUpon completion of the course, students will:\nbe able to apply these methods to relevant economic problems",
            "exam_format": "Form of assessment:\nDigital school assessment - Inspera\nProportion:\n100%\nDuration:\n2 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nCalculator",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCourseworks given:\n2\nCourseworks required:\n2\nPresence:\nNot required\nComment:",
            "recommended_requirements": "Basic knowledge of calculus and probability theory is an advantage. Participation in SØK710 Industrial Organization can be a benefit, but not a prerequisite."
        },
        {
            "course_code": "DRHS906",
            "name": "Professional Caring in the Intersection Between System and Lifeworld",
            "learning_outcomes": "After completing the course, the candidates have the following learning outcomes defined in knowledge, skills and general competence:\nKnowledge\nThe candidate should be able to\nMake the candidate capable of understanding the foundations for professional caring in the intersection between system and lifeworld\nHave insight into the mechanisms caused by the structural conditions and moral caring practice\nSkills\nThe candidate should be able to\nConceptualize and problematize the concept of care in various caring theories that deal with professional /practice care/caring in the intersection between system and lifeworld\nDevelop research design and understandable issues about what can promote quality in professional practice/care/caring in the intersection between system and lifeworld\nGeneral competencies\nThe candidate should be able to\nIdentify new and relevant issues and outline research design for these\nLead project and participate in debates dealing with professional care/caring in the intersection between system and lifeworld",
            "exam_format": "Individual scientific essay. Word count: 3000 words +/- 10 %. Pass/fail grading by internal examiner.",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Master's degree (or the equivalent). Participants enrolled in the Ph.D. program at Molde University College, Volda University College or other relevant Ph.D. programs have priority."
        },
        {
            "course_code": "DRL005",
            "name": "Philosophy of Science",
            "learning_outcomes": "Students will have developed an understanding of main positions in the philosophy of science, and be able to critically assess theories and research contributions in areas relevant to logistics research. Students will also be able to apply an ethical perspective to their research area.\nKnowledge\nThe doctoral student shall\nhave a good overview of the field of philosophy of science, including concepts, perspectives, theories and conflicts, and have obtained knowledge of its implications for own research.\nunderstand the importance of theoretical perspectives for both research and practical problem solving.\nresearch.\nhave a reflective approach, based on the philosophy of science, to the knowledge- frontiers within her/his research field.\nSkills\nThe doctoral student shall\nbe able to identify theoretical, ethical and methodological problems in the research process, and evaluate consequences of different approaches to these problems.\nbe able to, within her/his research tradition, identify strategic research questions and formulate realistic research plans, with knowledge-strategies informed by philosophy of science.\nGeneral competence\nThe doctoral student shall\nbe able to make independent ethical assessments in their field of work\nbe able to relate scientific traditions to positions in philosophy of science",
            "exam_format": "Examination is in the form of written and oral presentation of individual assignments related to the participants’ research interests.",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "A completed relevant Master’s degree.\nConcepts and topics of philosophy of science are applied on research within the participant’s own research tradition. Consequently, it is preferable that the participants have begun working with their doctoral thesis, making it possible to relate their own work to themes of philosophy of science. If the participant has not begun working with the thesis, it is necessary that a research plan is formulated, specifying research questions, method(s) and theoretical perspective(s)."
        },
        {
            "course_code": "DRL007",
            "name": "Cost benefit analysis",
            "learning_outcomes": "After completing the course, the student should have acquired the following:\nKnowledge\nin-depth of the theoretical foundation for advanced cost-benefit analysis and how they are applied within a selection of sectors.\nKnowledge about the strengths and weaknesses of the analytical framework\nIn-depth knowledge about one selected aspect or topic in which the student choose to specialise\nSkills\nAbility to apply and to develop theories and analytical models presented in the course to support research at PhD level\nCompetence\nAnalytical and writing abilities through the process of assignment writing",
            "exam_format": "Form of assessment:\nHome assessment\nProportion:\n%\nDuration:\n-\nGrouping:\nIndividual\nGrading scale:\nPass/fail\nSupport material:\nSeparate list, see below",
            "mandatory_assignments": "Mandatory coursework:\nAttendance for teaching\nCourseworks given:\nCourseworks required:\nPresence:\nNot required\nComment:\nParticipation during all lectures and other learning activities are mandatory.",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "DRL025",
            "name": "Supply Chain Performance Measurement",
            "learning_outcomes": "What is performance management in supply chains?\nWhy measure supply chain performance?\nWhat to measure in supply chain management?\nConcepts for measuring supply chain performance\nApplying the balanced scorecard to the measurement of supply chain performance\nMetrics and key performance indicators for supply chain performance\nCriteria for KPI selection, which indicators to use\nOrganization of the performance management system.",
            "exam_format": "Not specified",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "DRL027",
            "name": "Heuristics for stochastic optimization",
            "learning_outcomes": "By the end of the course, the participants should be able to\ndiscuss different paradigms for stochastic optimization\npresent basic designs of common metaheuristic frameworks\nexplain common ways of adapting metaheuristics to solve stochastic optimization problems\nprovide details of implementations of GRASP for solving Markov decision processes; adaptive large neighborhood search for robust optimization problems; tabu search for dynamic and stochastic routing problems; GRASP, iterated local search and progressive hedging for stochastic programming problems\nidentify sources of uncertainty in typical applications of vehicle routing and scheduling problems\nwrite a well-structured academic report/paper on a specialized topic within heuristics for stochastic optimization",
            "exam_format": "Form of assessment: Writing an academic paper/report on a topic related to the curriculum\nDuration:TBA\nGrouping:Individual\nGrading scale: Pass/Fail",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "The course is suitable for PhD candidates with some knowledge about stochastic optimization, who may learn how this domain can be approached using heuristics; PhD candidates with some knowledge about heuristics, who may learn how they need to be adapted to efficiently deal with stochastic problems; and PhD candidates with knowledge about vehicle routing and scheduling problems, who may learn how stochastic versions of such problems can be handled by heuristics."
        },
        {
            "course_code": "DRL030",
            "name": "Design and Measurement in Business Management",
            "learning_outcomes": "Knowledge\n:\nAt the end of this course, a successful candidate will be able:\nTo understand the strengths and limitations of various types of research designs\nTo understand internal, external and construct validity;\nTo understand the basics of measurement, sampling, and control\nTo develop a clear understanding of the benefits, limitations, uses and abuses of specific design choices. This is a skill you will refine further as you move forward to more advanced courses in statistical methods\nSkills:\nAt the end of this course, a successful candidate will be able:\nTo choose appropriate research design for an empirical study\nTo execute an empirical study\nTo report an empirical study\nGeneral competence:\nAt the end of this course, a successful candidate will develop:\nResearch communication skills\nCritical thinking\nAbility to effectively review empirical research",
            "exam_format": "Class Participation (15%)\nClass participation is a very important part of the learning process (as well as an important part of your grade). It is critical not only for your personal learning, but also for the learning of your fellow classmates. Much of the value of the class comes from prepared, thoughtful, and informed dialogue between you and your classmates. You are expected to read all the assigned materials and you should reflect upon and/or apply the material in those readings before class. Examples of good contributions to class discussions include: raising relevant, insightful questions concerning the readings; sharing your own personal insights about the topics; providing reactions and feedback to your peers; and helping others contribute their ideas.\nCourse paper (85%):\nDeadline for submission: 23.12.2023\nGrouping: Individual\nGrading scale: Letter (A - F)\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:18 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Similar to the requirements for admission to a PhD program in social sciences"
        },
        {
            "course_code": "DRL031",
            "name": "Emerging Technologies for Logistics and Business",
            "learning_outcomes": "Comprehensive Understanding of Emerging Technologies: Develop a thorough knowledge of key emerging technologies, including but not limited to artificial intelligence, digital twins, Internet of Things (IoT), and data analytics\nExplore the fundamental principles and concepts underlying each technology, gaining insight into their applications and potential impact on logistics and business.\nCritical Analysis of Disruptive Technology Trends: Analyze current trends and advancements in disruptive technologies within the context of logistics and business\nEvaluate the potential disruptive effects of these technologies on traditional business models and supply chain processes.\nIntegration of Technologies in Business Strategies: Demonstrate the ability to strategically integrate emerging technologies into business operations and logistics management.\nDevelop proficiency in identifying opportunities for technological innovation and applying these insights to enhance organizational efficiency and competitiveness.\nApplication of Technology in Real-world Scenarios: Apply theoretical knowledge to real-world case studies and practical scenarios, simulating the challenges and decision-making processes associated with the adoption of emerging technologies.",
            "exam_format": "Not specified",
            "mandatory_assignments": "30 hours lectures plus student presentations and individual work with the course paper.\nAll lectures are mandatory\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:18 PM",
            "recommended_requirements": "Entry requirement: Admitted to a PhD program"
        },
        {
            "course_code": "DRL032",
            "name": "Graph Theory with Applications in Logistics",
            "learning_outcomes": "The student should be able to identify when graph theory can be used to solve (part of) a problem in logistics and to implement the corresponding algorithms.",
            "exam_format": "Submission of a course paper within two weeks after the course.\nGrading scale: Pass / Fail\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:18 PM",
            "mandatory_assignments": "30 h lectures. All lectures are mandatory.\nOne daily exercise must also be approved.",
            "recommended_requirements": "Basic knowledge on logic, mathematics. Previous knowledge in algorithm design is a plus."
        },
        {
            "course_code": "DRL033",
            "name": "Critical Governance Perspectives in Transport Policy and Planning",
            "learning_outcomes": "After the course, the students should have in-depth knowledge of the origins and development of key concepts within:\nMulti-level governance and accountability\nPower in heterogeneous networks: The advocacy coalition framework\nObjects as mediators\nThe role of Planners and ethics\nRight to the city - citizen engagement from bottom-up\nStudents should also be able to relate these areas to current practices and theories.",
            "exam_format": "A final 3-4 page paper should be submitted at the end of the course, based on one of the themes addressed.  The theme should them be related to the student’s own research.\nGrading scale: Pass / Fail",
            "mandatory_assignments": "Active participation in all seminars\nA short (2 page) preparatory paper with discussion points should be written to each seminar, comprising\nA short summary of the articles\nA comparison of the articles in relation to each other, similarities, differences, perspectives\nA list of three questions you want to address at the seminar",
            "recommended_requirements": "The course is open for all doctoral students. You don’t have to have a background from social science to understand the texts or discuss the themes. However, an interest in transport and mobility questions is encouraged."
        },
        {
            "course_code": "DRL034",
            "name": "Strategic Decision-Making in Logistics",
            "learning_outcomes": "Students will develop an in-depth understanding of main theoretical concepts and principles of game theory (e.g. strategic games, strategies, Nash equilibrium; extensive form games, backward induction, subgame perfection; cooperative games, core, allocation rules).\nStudents will acquire an overview of the existing extensions of classical game-theoretic concepts to problems within logistics and supply chain management, such as routing games, network games, cost allocations in supply chains under uncertainty.\nStudents should be able to identify environments with strategic interactions and structure real-world problems in supply chain management and logistics as games, using the formal language of game theory.\nStudents will develop critical approach to the research in applied game theory and be able to evaluate the effectiveness of different game-theoretical models in addressing logistics challenges.\nStudents will be able to contribute to the research on applications of game-theoretic concepts to logistics and supply chain management.",
            "exam_format": "Submission of a course paper within four weeks after the course.",
            "mandatory_assignments": "All lectures and workshops must be attended. One presentation during the course week.",
            "recommended_requirements": "Accepted as a PhD student\nBasic math skills and some understanding of probability theory\nSome knowledge of microeconomics might be an advantage."
        },
        {
            "course_code": "DRL035",
            "name": "Stated Choice Analysis",
            "learning_outcomes": "After completing the course, the student should have acquired the following:\nKnowledge\nIn-depth of the theoretical foundation for stated preference and discrete choice models and how they can be practically applied in a selected topic in which the student chooses to specialize.\nLearning how to apply cutting hedge methods and be familiar with survey design, modelling, analysis, and interpretation.\nSkills\nAbility to apply and to practically develop data acquisition and modeling to support research at PhD level. In fact, the methods presented in the course can be used to investigate any specific topic within social science disciplines as a basis for writing scientific papers.\nCompetence\nAnalytical, programming, presenting, and writing abilities through hands-on exercises and assignments.",
            "exam_format": "Form of assessment:\nIndividual home exam in the form of a written report based on data provided by the teacher\nProportion: 100\n%",
            "mandatory_assignments": "Required participation in all lectures, practical sessions and mandatory student presentations.",
            "recommended_requirements": "Basic Microeconomics and statistical knowledge. Students with a weak background should read up on consumer theory and regression analysis."
        },
        {
            "course_code": "DRL036",
            "name": "Covariance-Based Structural Equation Modeling: Theory and Applications",
            "learning_outcomes": "Not specified",
            "exam_format": "Individual term paper, Graded A-F.",
            "mandatory_assignments": "Mandatory physical attendance",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "IBE110",
            "name": "Information Technology",
            "learning_outcomes": "Knowledge\nThe student will be familiar with the historical advancements in information technology to understand the possibilities and limitations of current technologies.\nThe student will acquire knowledge of how data, hardware, software and communication systems are built and how these are used.\nSkills\nThe student will have skills to analyze simple problems related to computer systems.\nGeneral competences\nThe student will be competent to contribute and give qualified evaluations regarding pros and cons of current information technologies.",
            "exam_format": "Form of assessment:\nDigital home assessment - Inspera\nProportion:\n100%\nDuration:\n3 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupported material:\nAll printed and written supporting material",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCourseworks given:\n4\nCourseworks required:\n4\nPresence:\nNot required\nComment:",
            "recommended_requirements": "General knowledge about computers is an advantage."
        },
        {
            "course_code": "IBE201",
            "name": "Information Management",
            "learning_outcomes": "Studenten skal etter fullført emne :\nKunnskaper\nforstår hva som inngår i effektiv informasjonsbehandling på en arbeidsplass\nkjenne til bruksprinsipper for moderne programvare generelt\nFerdigheter\nanvende programvare for tekstbehandling, regneark og database, herunder også bruk av tilhørende dokumentasjon for å forstå funksjonalitet og håndtering av feilmeldinger.\nkunne legge til rette for effektiv behandling av informasjon i form av tall, tekst og andre data ved hjelp av programvare for kontorstøtte.\nvære i stand til å tilpasse verktøyet til oppgaven og kan lage opplegg for informasjonsbehandling som fremmer høy produktivitet og kvalitet og samtidig reduserer risikoen for feil i arbeidet.\nGenerell kompetanse\ndelta i effektiviseringsprosesser på en arbeidsplass",
            "exam_format": "Form of assessment:\n-\nProportion:\n100%\nDuration:\n5 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:19 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Ingen spesielle, men studenten bør ha grunnleggende kompetanse i bruk av kontorstøtteverktøyene regneark og tekstbehandling."
        },
        {
            "course_code": "IBE201",
            "name": "Information Management",
            "learning_outcomes": "Studenten skal etter fullført emne :\nKunnskaper\nforstår hva som inngår i effektiv informasjonsbehandling på en arbeidsplass\nkjenne til bruksprinsipper for moderne programvare generelt\nFerdigheter\nanvende programvare for tekstbehandling, regneark og database, herunder også bruk av tilhørende dokumentasjon for å forstå funksjonalitet og håndtering av feilmeldinger.\nkunne legge til rette for effektiv behandling av informasjon i form av tall, tekst og andre data ved hjelp av programvare for kontorstøtte.\nvære i stand til å tilpasse verktøyet til oppgaven og kan lage opplegg for informasjonsbehandling som fremmer høy produktivitet og kvalitet og samtidig reduserer risikoen for feil i arbeidet.\nGenerell kompetanse\ndelta i effektiviseringsprosesser på en arbeidsplass",
            "exam_format": "Form of assessment:\n-\nProportion:\n100%\nDuration:\n5 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:34 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Ingen spesielle, men studenten bør ha grunnleggende kompetanse i bruk av kontorstøtteverktøyene regneark og tekstbehandling."
        },
        {
            "course_code": "IBE211",
            "name": "Databases",
            "learning_outcomes": "After completing the course, the student will have achieved the following learning outcomes:\nKnowledge\nThe candidate:\nhas knowledge of the technical principles behind the construction and functioning of databases.\nunderstands how databases integrate into and support broader information systems.\nhas an overview of key phases in the database development lifecycle, including design, implementation, and maintenance.\nhas knowledge of performance considerations and operational tasks related to database systems.\nSkills\nThe candidate:\ncan design basic data models using the Entity-Relationship (ER) method.\ncan apply normalization techniques to improve data structure and integrity.\ncan implement, query, and manage relational databases using SQL.\ncan assess and address simple performance and operational issues in database systems.\nGeneral Competence\nThe candidate:\ncan contribute to the planning and execution of smaller development projects involving data storage and retrieval.\ncan participate in routine operational tasks related to database systems.\ndemonstrates an understanding of ethical and legal considerations related to data management and storage.",
            "exam_format": "Form of assessment: Digital Home Exam\nProportion: 100%\nDuration: 4 hours\nGrouping: Individual\nGrading scale: Letter (A - F)\nSupported material: All printed and written supporting material\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:34 PM",
            "mandatory_assignments": "Mandatory coursework requirement: Assignment(s)\nNumber of coursework requirements: 3\nRequired coursework submissions: 3",
            "recommended_requirements": "IBE152 or a similar, solid introductory course in programming. Students are expected to have basic programming skills, including familiarity with variables, functions, and simple data structures."
        },
        {
            "course_code": "IBE220",
            "name": "Digital Communication: Human-Technology Interaction",
            "learning_outcomes": "Not specified",
            "exam_format": "Form of assessment:\nHome Assessment\nGrouping:\nIndividual.\nProportion:\n100%\nDuration:\n1 week\nGrading Scale:\nLetters (A - F)\nSupporting Material:\nAll printed and written supporting material.\nComment:\nFinal Written Report – Report on the student group’s selected case: The group will upload on Canvas a minimum of a 5-pages (but can be longer) written report that is based on the original question-set in Assignment 1 and 2. The report should take into consideration the feedback obtained at the presentation or other feedback provided by the teacher.",
            "mandatory_assignments": "Coursework requirements:\nAssignments\nAssignments given:\n2\nAssignments required:\n2\nAttendance:\nNot required, but encouraged\nGrouping:\nIt is preferred that students work in groups of size 2-4, but it is possible to ask for permission to work individually.\nComment:\nStudents must complete Assignment 1 and 2 in order to continue to the Home Assessment.\nAssignment 1: The student group will select a digital communication technology as a topic of a case study. They will create a video presentation and deliver it to the instructor based on a question-set that will be provided at course start.\nAssignment 2: The group will play their video within their assigned date and timeslot of a zoom lecture. The group must be available live (on zoom) to answer questions during their assigned timeslot.",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "IBE320",
            "name": "Extended Reality",
            "learning_outcomes": "On completion of the course the student will have knowledge of:\nthe hardware and software involved in creating the XR experiences,\nXR design and development processes, etc\nhow human beings interact with XR systems.\nThe student will have competence to:\nassess how XR can address identified needs, etc\ncontribute in projects where they consider using or developing XR as part of the solutions.\nThe student will have acquired skills in:\nsetting up XR experiences using software, etc\nevaluating XR systems.\nThe student will gain a sense of:\nthe social consequences of XR technologies, and\nthe environmental impact of using XR in a variety of settings.",
            "exam_format": "Form of assessment: Two home exams\nShare: 60%\nGrouping: Individual\nGrading: Letter (AF)\nSupport material: All printed and written supporting material\nForm of assessment: Digital School Exam\nShare: 40%\nDuration: 4 hours\nGrouping: Individual\nGrading: Letter (AF)\nConditions for taking the exam: Student must pass the exam qualifying assignment to take the final exam\nSupport material: Only general dictionary in mother tongue/Norwegian/English in paper version\nNote: A partial fail does not automatically imply a fail as the final grade. Instead, the final grade will be determined as the average of all the partial assessments.\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:34 PM",
            "mandatory_assignments": "Mandatory coursework: Assignments and attendance at lectures\nAssignments given: 3\nAssignments required: 3\nAttendance: Required\nComment: Two of the assignments are graded numerically and converted to the equivalent letter grade. The third assignment is an exam qualifying assignment and is graded pass/fail.",
            "recommended_requirements": "Programming is required (not just recommended)"
        },
        {
            "course_code": "IBE321",
            "name": "Information Security and Risk Management",
            "learning_outcomes": "After completion of the course, the student will have acquired the following learning outcomes, defined as knowledge, skills and general competency:\nKnowledge\nhas general knowledge on different types of malware and how the CIA properties of the information can be compromised and have an overview of relevant categories of unwanted incidents.\nunderstands fundamental security concepts such as confidentiality, integrity and availability, authorization, authentication and accountability.\nhas general knowledge on security design principles.\nSkills\nThe student:\nis able to implement effective countermeasures against different attacks such as viruses, worms, phishing, ransomware, and eavesdropping.\ncan formulate security policies and perform a risk assessment.\nCompetence\ncan contribute to the ICT security posture of an organization.",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n100%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nO\nnly general dictionary in mother tongue/Norwegian/English in paper version",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCourseworks given:\n4\nCourseworks required:\n4\nPresence:\nNot required\nComment:",
            "recommended_requirements": "Basic knowledge of computer programming and networking is recommended."
        },
        {
            "course_code": "IBE400",
            "name": "Machine Learning",
            "learning_outcomes": "Students will, after passing the examination, have\nKnowledge\nSolid foundation in the basic machine learning principles and practical skills.\nAnalyze data sets using a range of machine learning algorithms\nIdentify patterns and relationships in data\nUnderstanding of the role of data preprocessing, feature selection, and model evaluation in machine learning\nSkills\nDemonstrate the ability to describe the machine learning techniques of Linear classification, Logistic regression, Decision Trees, Multi-class Classification, Naïve Bayes, Neural Networks, Clustering, Principal Component Analysis & Autoencoders, Support Vector Machines, Ensemble methods, Reinforcement Learning\nUse machine learning algorithms to develop programs that effectively solve real-world problems.\nCompetence\nBe able to apply ML techniques to real-world data sets.",
            "exam_format": "Form of assessment: Digital School assessment\nProportion: 100%\nDuration: 3 hours\nGrouping: Individual\nGrading scale: Letter (A - F)\nSupport material: None",
            "mandatory_assignments": "Mandatory coursework:\nAssignments. Group of 1-3 students\nCoursework given:\n2\nCoursework required:\n2\nGrading: Approved/Not approved",
            "recommended_requirements": "You should have basic skills with programming languages such as Python, or R or Matlab, statistics and mathematics (including calculus, probability, and statistical inference).\nIt is also beneficial to have a background in data analysis and visualization."
        },
        {
            "course_code": "IBE405",
            "name": "The Internet of Things and Smart Cities",
            "learning_outcomes": "On completion of the course the student will have knowledge of:\nthe theory and principles of Smart Cities,\nthe socio-centric as well as techno-centric perspectives of Smart Cities,.\nrepresentative smart city projects,\nthe foundations of IoT digital smart city architectures,\nthe primary hardware and software involved in the deployment of IoT.\nThe student will have competence to:\nassess how IoT technologies can address needs identified for Smart Cities, and\ncontribute in projects seeking or developing IoT Smart Cities solutions.\nThe student will have acquired skills in:\nbasic hands-on experience with IoT systems,\nprogramming IoT prototypes,\nability to visualize and analyze data relevant to Smart Cities,\ndeveloping sensor-based architecture,\nassessing communication options for IoT systems within Smart Cities, and\nanalyzing data relevant to Smart Cities.",
            "exam_format": "Form of assessment:\nPractical project assessment\nProportion:\n70%\nDuration:\n3.5 weeks\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material\nForm of assessment:\nSchool assessment\nProportion:\n30%\nDuration:\n4 hours\nConditions for taking the exam:\nStudent must pass the project to take the final exam\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nNone\nNote: A partial fail does not automatically imply a fail as the final grade. Instead, the final grade will be determined as the average of all the partial assessments.",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCourseworks given:\n4\nCourseworks required:\n4\nPresence:\nRequired",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "IBE440",
            "name": "Fundamentals of Simulation Modeling",
            "learning_outcomes": "Upon completion of the course, the students will\nKnowledge\n:\nunderstand the basic concepts of simulation modeling\nbe able to identify real-life problems within various industries which can be modeled and analyzed using simulation techniques\nSkills\n:\nbe able to perform input data collection and analysis\nbe able to design simulation models of business processes\nbe able to conduct experiments, interpret and visualize output data\nGeneral competence\n:\nStudents will acquire new knowledge and skills to conduct a simulation study using relevant software",
            "exam_format": "Form of Assessment:\nHome assessment\nGrouping:\nGroup\nDuration:\n1 week\nGrading scale:\nLetter (A-F)\nSupport Material:\nAll printed and written supporting material",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCourseworks given:\n2\nCourseworks required:\n2",
            "recommended_requirements": "Knowledge of the basics of statistics might be an advantage, but not a prerequisite"
        },
        {
            "course_code": "IBE450",
            "name": "Artificial Intelligence",
            "learning_outcomes": "By the end of the course after having passed the examination, participants will have gained the knowledge, skills, and competence necessary to navigate the dynamic field of Artificial Intelligence, setting a solid foundation for future learning and engagement in AI-related endeavours.\nKnowledge:\nFoundational Understanding: Demonstrate a comprehensive knowledge of fundamental AI concepts, including machine learning, neural networks, and algorithms.\nAI Applications: Acquire knowledge about AI applications with a focus on their societal uses, across various sectors, such as healthcare and finance, and develop insights into the implications of AI for everyday routines, understanding of the distinction between software-based and hardware-based AI applications.\nSkills:\nProgramming Skills: Develop basic programming skills in Python for AI applications, enabling participants to engage with coding exercises and simple AI program development.\nCritical Thinking: Analyze and evaluate the societal impacts of AI, recognizing potential biases, ethical concerns, and challenges that may arise in the development and deployment of AI systems.\nApplication Design: Apply AI concepts and principles in hands-on projects, demonstrating the ability to design and implement simple AI applications.\nCommunication: Effectively communicate and engage in conversations about AI's impact on society, presenting informed perspectives on ethical considerations and potential challenges.\nCompetence:\nProblem-Solving: Demonstrate competence in identifying potential challenges in AI applications and proposing solutions that align with ethical principles.\nFuture Orientation: Anticipate and discuss potential future trajectories of AI, considering technological advancements, societal shifts, and ethical considerations.\nEthical Decision-Making: Develop competence in making ethical decisions related to AI development and application, considering the broader societal implications.\nEntry-Level Proficiency: Attain a level of proficiency that allows participants to confidently enter the world of AI, engaging in discussions and further exploration of advanced AI topics.",
            "exam_format": "Form of assessment: Digital School assessment\nProportion: 100%\nDuration: 3 hours\nGrouping: Individual\nGrading scale: Letter (A - F)\nSupport material: None",
            "mandatory_assignments": "Coursework requirement:\nCapstone Report - Capstone report would essentially be an opportunity to self-reflect and showcase an understanding.\nIndividual/group:\nGroup\n(1-3 students)\nNumber of coursework requirements:\n1\nRequired coursework requirements:\n1\nComment:\nProject report\nCoursework requirement:\nAssignment\nNumber of work requirements:\n1\nRequired work requirements:\n1\nIndividual/group:\nGroup\n(1-3 students)\nProject work and the assignment will be evaluated as approved/not approved.",
            "recommended_requirements": "IBE152 Introduction to Programming or equivalent is required to take this courIn addtion, it is highly recommended that you have a minimum of grade C in IBE152 or equivalent course.\nIBE450 Artificial Intelligence in the Semester 4 (Spring semester) course will serve as a precursor for the Machine Learning course to be offered in Semester 5 (fall semester).\nThe curriculum incorporates coding exercises designed to facilitate the understanding of development of elementary AI modules. Students are expected to demonstrate a strong command of basic programming, with a preference for proficiency in Python. While the latter is considered an added advantage, a solid foundation in programming is non-negotiable for successful completion of this course."
        },
        {
            "course_code": "IBE500",
            "name": "Blockchain Fundaments",
            "learning_outcomes": "Knowledge\nBasic theory on transactions, blocks, blockchains, smart contracts and crypto currencies\nDecision model for when a blockchain is suitable\nUnderstanding the business case of blockchain application\nBlockchain-related challenges\nSkills\nHow to make Smart Contract in a blockchain\nHow to make blockchain implementation to different areas\nHow to make applications using the blockchain\nGeneral competence\nBe able to see the connection between the theoretical knowledge on blockchains and the practical skills on blockchain based business applications.",
            "exam_format": "Evaluation based on exam (40%) and a project work (60%)\nWritten school exam\nProportion of total assessment: 40%\nDuration: 2 hours\nGrouping: Individual\nGrading scale: Letter (A - F)\nSupport material allowed: All written material and calculator\nApplied project - 60%\nEvaluated via a written report describing the applied work performed.\nGrading: Letter scale AF.",
            "mandatory_assignments": "Exam Eligibility Rules\nWeekly assignments: Complete at least 75% of all weekly assignments.\nAttendance: Attend at least 80% of scheduled classes.",
            "recommended_requirements": "Prerequisites: None."
        },
        {
            "course_code": "IBE505",
            "name": "Industrial Digitalization",
            "learning_outcomes": "Knowledge\nunderstand how cybernetic processes are constructed\nknow cybernetic processes in working life and public sector\nknow systems development for automation and robotics\nSkills\nknow how to make cybernetic software\ndesign complex integrated systems that automate tasks using data analysis, decision support, automation and robotics\nexecute validation and verification through inspection and testing, to ensure safe and preditable software systems.\nCompetence\ncontribute to projects where automation and robotics is being considered as part of the information processing system.",
            "exam_format": "Vurderingsform:\nHjemmeeksamen\nAndel:\n100%\nVarighet:\n4 timer\nGruppering:\nIndividuell\nKarakterskala:\nBokstavkarakter (A - F)\nHjelpemidler:\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:35 PM",
            "mandatory_assignments": "Obligatorisk arbeidskrav:\nOppgave(r)\nAntall arbeidskrav:\n2\nPåkrevde arbeidskrav:\n2\nFremmøte:\nIkke påkrevd\nKommentar:",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "IBE700",
            "name": "Enterprise Resources Planning",
            "learning_outcomes": "Knowledge\nknow why the ERP system forms the digital backbone of a company\nknow basic business process modeling with actions, organizational units, and data involved\nknow how ERP systems affect operational, tactical and strategic organizational levels\nSkills\nskills for execution of business transactions for the internal company supply chain by using an ERP-system\nskills for finding and applying core information for execution of business-to-business (B2B) transactions in external supply chains\nskills in handling bids and offers in acquisition of an ERP system for a company\nCompetence\ncompetence in combining the theoretical knowledge and practical skills of ERP systems to be able to contribute to the application of ERP systems in companies\ncompetence of the core information flow in business-to-business (B2B) procurement and sales transactions",
            "exam_format": "Form of assessment:\nReport and oral presentation of report\nProportion:\n100%\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupported material:\nNone allowed\nComment:\nExamination will focus on the mandatory project report",
            "mandatory_assignments": "Mandatory coursework:\nCompletion of 10 assignments\nCoursework required:\n100% of assignments\nPresence:\nMandatory for 80% of lectures in-class or digital\nMandatory attendance in roleplay on ERP buying-and-selling\nCourseworks required:\n100%",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "IBE710",
            "name": "AI in Logistics",
            "learning_outcomes": "Knowledge:\nUnderstand the fundamental concepts of Artificial Intelligence (AI) and its applications in logistics.\nGain insights into the various AI technologies used to optimize logistics operations, including data analysis, visualization, and predictive modeling.\nLearn about the impact of AI on improving efficiency and decision-making within the logistics sector through case studies and industry examples.\nSkills:\nLearn to perform exploratory data analysis (EDA) to identify patterns and trends in logistics data.\nLearn to implement time series forecasting models to predict future logistics demands and operations.\nApply clustering techniques to segment logistics data for targeted strategies and optimization.\nCompetence:\nExhibit competence in analyzing complex logistics datasets and deriving actionable insights for improvements.\nApply theoretical knowledge and practical skills to real-world logistics scenarios, showcasing an understanding of how AI technologies can transform supply chain management.",
            "exam_format": "Form of assessment: School assessment\nProportion: 100%\nDuration: 3 hours\nGrouping: Individual\nGrading scale: Letter (A - F)\nSupport material: None",
            "mandatory_assignments": "Mandatory coursework: Assignment(s)\nCoursework given: 3\nCoursework required: 3\nAttendance: Required\nAll the 3 assignments will be evaluated as approved/not approved",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "IBE800",
            "name": "Digital Communication: Customer Experience and Relationships",
            "learning_outcomes": "Knowledge:\nH\nas advanced knowledge within the academic field and specialized insight in\nthe fundamental concepts of Digital Communication (DC) in managing customer experience and relationships.\nH\nas advanced knowledge of\ntheories and frameworks for how in human work and interaction design\nH\nas advanced knowledge of\nmarketing and analytical approaches to managing the customer-product relationship\nSkills:\nCan analyze and deal critically with various sources of information and use them to structure and formulate\nto develop and implement communication strategies that align with organizational goals.\nCan use relevant methods for\nresearch work in an independent manner\nto manage data in customer relationships, including management of big data collected through web analytics, surveys and software\nCan analyze existing theories, methods and interpretations in the field and work\nwith digital tools to identify trends, patterns and insights to manage communication strategies\nCan carry out an independent, limited research or development project under supervision and in accordance with applicable norms for research ethics\nGeneral competence:\nC\nan analyze relevant academic, professional and research\nthe ethical and social implications of business communication and customer relations practices.\nC\nan analyze relevant academic, professional and research\nanalyze major trends in digital communication for customer engagement\nC\nan contribute\nto work businesses in public or private sectors to foster new connections, networked communities and value exchange\nCan communicate about academic issues, analyses and conclusions in the field, both with specialists and the general public\nCan contribute to new thinking and innovation processes",
            "exam_format": "Form of assessment:\nOral Home Exam\nDuration:\n20 minutes\nProportion:\n100%\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nComment:",
            "mandatory_assignments": "Mandatory coursework:\nAssignments\nCourseworks given:\n2\nCourseworks required:\n2\nGrouping:\ngroups up to four students\nPresence:\ndigital attendance by at least one member of the group is required on due dates for discussion of deliverables in lecture\nComment:\nThe students must submit (1) a written digital communication strategic plan for a mock-organization and (2) deliver a pre-recorded video presentation of that strategic plan.",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "IBE800",
            "name": "Digital Communication: Customer Experience and Relationships",
            "learning_outcomes": "Knowledge:\nH\nas advanced knowledge within the academic field and specialized insight in\nthe fundamental concepts of Digital Communication (DC) in managing customer experience and relationships.\nH\nas advanced knowledge of\ntheories and frameworks for how in human work and interaction design\nH\nas advanced knowledge of\nmarketing and analytical approaches to managing the customer-product relationship\nSkills:\nCan analyze and deal critically with various sources of information and use them to structure and formulate\nto develop and implement communication strategies that align with organizational goals.\nCan use relevant methods for\nresearch work in an independent manner\nto manage data in customer relationships, including management of big data collected through web analytics, surveys and software\nCan analyze existing theories, methods and interpretations in the field and work\nwith digital tools to identify trends, patterns and insights to manage communication strategies\nCan carry out an independent, limited research or development project under supervision and in accordance with applicable norms for research ethics\nGeneral competence:\nC\nan analyze relevant academic, professional and research\nthe ethical and social implications of business communication and customer relations practices.\nC\nan analyze relevant academic, professional and research\nanalyze major trends in digital communication for customer engagement\nC\nan contribute\nto work businesses in public or private sectors to foster new connections, networked communities and value exchange\nCan communicate about academic issues, analyses and conclusions in the field, both with specialists and the general public\nCan contribute to new thinking and innovation processes",
            "exam_format": "Form of assessment:\nOral Home Exam\nDuration:\n20 minutes\nProportion:\n100%\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nComment:",
            "mandatory_assignments": "Mandatory coursework:\nAssignments\nCourseworks given:\n2\nCourseworks required:\n2\nGrouping:\ngroups up to four students\nPresence:\ndigital attendance by at least one member of the group is required on due dates for discussion of deliverables in lecture\nComment:\nThe students must submit (1) a written digital communication strategic plan for a mock-organization and (2) deliver a pre-recorded video presentation of that strategic plan.",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "IBE810",
            "name": "Blockchain for Business",
            "learning_outcomes": "Knowledge:\nHas advanced knowledge within the academic field to understand the principles and frameworks of blockchain and their impact on business strategy and operations.\nHas advanced knowledge within the academic field to understand the fundamental concepts of Blockchain technology and its business applications\nHas advanced knowledge to analyze the strategic and operational impacts of Blockchain in the business environment\nCan apply knowledge to new blockchain on digital business strategy.\nSkills:\nCan analyze existing theories, methods and interpretations in the field and work independently on practical and theoretical problems to develop and implement blockchain solutions.\nCan use relevant methods for doing research in an independent mannerto identify and apply innovation opportunities and digital transformation through Blockchain.\nCan use relevant methods for research work in an independent manner to solve complex issues in digital business management.\nGeneral competence:\nCan analyze relevant academic, professional and research ethical problems\nCan communicate about academic issues, analyses and conclusions in the field, both with specialists and the general public\nCan analyze relevant academic, professional and research ethical problemsprepare for blockchain solutions across various industries.",
            "exam_format": "Form of assessment:\nThe project report and an oral presentation of the report\nProportion:\n100% /\nGrouping:\nIndividual /\nGrading scale:\nLetter (A - F)\nSupported material:\nNone",
            "mandatory_assignments": "Attendance is mandatory for at least 80% of the lessons, and all assignments must be submitted on time with passing acore",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "IBE820",
            "name": "Advances in Digital Business Management",
            "learning_outcomes": "Knowledge:\nHas\nadvanced knowledge\nto understand the principles and frameworks of digital transformation and their impact on business strategy and operations.\nCan apply knowledge to new\nemerging digital business models\nCan analyse the impact of business environment factors on digital business strategy and decision-making.\nSkills:\nCan analyze and deal critically\nto develop and implement digital strategies that align with organizational goals.\nCan analyze and deal critically to innovate a digital business model\nC\nan analyze existing theories, methods and interpretations\nin digital business management.\nCan carry out an independent, limited research or development project under supervision and in accordance with applicable norms for research ethics\nGeneral competence:\nCan apply his/her knowledge and skills in new areas to carry out advanced assignments and project\nCan analyze relevant academic, professional and research ethical problems\nthe ethical and social implications of business practices.\nCan apply his/her knowledge and skills in new areas to carry out advanced assignments and projects\nto lead and collaborate in organizational change initiatives\nC\nan contribute to new thinking and innovation processes\nfor business disruptions",
            "exam_format": "Examination:\nPart 1: Mini-case analysis and report writing (40%)\nPart 2: Capstone project - (60%).\nGrading scale:\nLetter (A - F).",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "IBE840",
            "name": "Applied AI",
            "learning_outcomes": "Knowledge:\nHas advanced knowledge within the academic field and specialized insight in the u\nunderstand the core principles of AI and machine learning.\nHas advanced knowledge within the academic field and specialized insight in a\nnalyze the impact of AI on various industries.\nHas advanced knowledge within the academic field and specialized insight in\nevaluate the ethical implications of AI technologies.\nSkills:\nAbility to design and implement machine learning models.\nAbility to apply AI techniques to solve complex problems.\nAbility to assess the performance of AI systems.\nGeneral Competence:\nCan analyze relevant academic, professional and research ethical problems\nCan apply his/her knowledge and skills in\nto critically evaluate the societal impact of AI.\nCan apply his/her knowledge and skills in\nto lead projects involving AI integration.\nC\nan apply his/her knowledge and skills\nto adapt to emerging trends in AI technology.",
            "exam_format": "Examination\nPart 1: Practical assignments and report writing (40%).\nPart 2: Capstone project - Development and presentation of an AI solution (60%\n).\nGrading scale:\nLetter (A - F)",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "IBE850",
            "name": "Generative AI, Text Mining, and Computer Vision for Business Efficiency",
            "learning_outcomes": "Knowledge:\nHas advanced knowledge within the academic field and specialized insight to analyze and deal critically with various sources of information and use them to structure and formulate scholarly arguments\nHas advanced knowledge within the academic field and specialized insight to\nunderstand the fundamentals of Generative AI, Text Mining, and Computer Vision.\nHas advanced knowledge within the academic field and specialized insight to\nunderstand the AI principles\nSkills:\nCan use relevant methods for research and p\nractical experience in designing and implementing Generative AI, Text Mining, and Computer Vision solutions for real-world problems.\nCan carry out an independent, limited research or development project under supervision\nfor the applying Generative AI, Text Mining, and Computer Vision to enhance management workflows, creating significant improvements in operational efficiency, decision-making, and cost reduction.\nCan use relevant methods for research for\nText Mining to analyze large volumes of textual data and extract actionable insights for decision-making\nCan use relevant methods for research in a practical application\nof these technologies in management scenarios, focusing on improving productivity, cost-saving, and automation.\nGeneral competence:\nCan carry out an independent, limited research or development project under supervision and in accordance with applicable norms for research ethic\nC\nan apply his/her knowledge and skills\nto Generative AI models to create business content, reports, and automated solutions.\nCan contribute to new thinking and innovation processes\nto lead organizational change initiatives.\nC\nan apply his/her knowledge and skills\nto prepare IoT solutions across various industries.\nCan contribute to new thinking and innovation processes.",
            "exam_format": "Form of assessment:\nThe project report and an oral presentation of the report\nProportion:\n100%  /\nGrouping:\nIndividual  /\nGrading scale:\nLetter (A - F)",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "IBE950",
            "name": "Master's Degree Thesis",
            "learning_outcomes": "Knowledge:\nHas advanced knowledge of the scholarly and methods in the field\nCan apply knowledge to new areas within the academic field\nCan analyze academic problems on the basis of the history, traditions, distinctive character and place in society of the academic field\nCan apply knowledge to new areas within the academic field Has advanced knowledge within to plan and organize the project that forms the basis for the master's thesis\nSkills:\nCan analyze and deal critically with various sources of information and use them to structure and formulate scholarly arguments\nCan analyze existing theories, methods and interpretations in the field and work independently on practical and theoretical problems\nCan use relevant methods for research and scholarly and /or artistic development work in an independent manner\nCan carry out an independent, limited research or development project under supervision and in accordance with applicable norms for research ethics\nGeneral competence:\nCan analyze relevant academic, professional and research ethical problems\nCan apply his/her knowledge and skills in new areas in order to carry out advanced assignments and projects\nCan communicate extensive independent work and masters language and terminology of the academic field\nCan communicate about academic issues, analyses and conclusions in the field, both with specialists and the general public\nCan contribute to new thinking and innovation processes",
            "exam_format": "Assessment method: Master's thesis and oral presentation of the thesis.\n/\nProportion: 100%.\n/\nGrouping: Individual.\nLetter grade A – F",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "IDA715",
            "name": "Discrete Event Simulation",
            "learning_outcomes": "Knowledge\nUnderstand the characteristics of discrete-event simulation methodology, as well as the effects of uncertainty on performance of modelled systems.\nUnderstand the simulation modeling software environment, including handling of input and output data, modeling blocks and flowcharting capabilities, experiment design functionality.\nSkills\nBuild own simulation models in order to analyze processes in logistics and supply chain management.\nPerform input data collection and analysis.\nDesign, implement, and validate simulation models.\nIncorporate uncertainty into simulation models.\nAnalyze and calibrate models based on observed input data.\nInterpret simulation results and draw conclusions.\nGeneral competence\nRecognize real-world problems and situations where discrete-event simulation models can be used to improve decision making.",
            "exam_format": "Form of assessment:\nHome assessment\nProportion:\n100%\nDuration:\n4 weeks\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupported material:\nAll printed and written materials",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCourseworks given:\n1\nCourseworks required:\n1\nPresence:\nRequired\nComment:\nA set of compulsory exercises to model using the course’s choice of simulation software",
            "recommended_requirements": "Knowledge of statistics and basics of computer programming will be an advantage."
        },
        {
            "course_code": "IDA720",
            "name": "Applied Data Analytics",
            "learning_outcomes": "The candidates will be able to properly organize the data analysis project.\nWithin a given business area, the students will be able to\nformulate a practical question\nof interest which may be answered with an existing dataset or a dataset that may be procured.\nThey will have the skills to\nretrieve the data\nin various formats from\nvarious sources\n, such as files stored locally and remotely, web application programming interfaces (Web APIs), databases, etc. They will be able to work with\nvarious file formats\n, e.g., text files (txt, rtf, docx), tabular records (csv, xls), markup files (xml, json) and others.\nThey will have the necessary skills to explore how the available data fits the question of interest.\nThey will have the skills to\nselect the necessary data, reorganize, transform and clean the data\n(reconcile the situations with missing, incorrect or inconsistent data). They will be able to manipulate the arrays of various data types: numerical (integer, floating point and Boolean), date and time, text, etc.\nThey will be able to\nselect the appropriate approach to formal modelling\n, as well as being able to evaluate the applicability of the chosen model. For the problems of predictive nature, the students will be able to apply such methods as linear and nonlinear regression, neural networks, random forests, boosting, time-series analysis, etc. For the problems of revealing patterns in the data, the students will have the skills to employ such approaches as hierarchical clustering, principal components analysis, factor analysis, and others.\nUpon obtaining the results and diagnosing the fitness of the analytical approach, the students will be able to\ninterpret, visualize and communicate\nthe results to the appropriate audience.\nGenerally, the candidates will have the appropriate skills to turn a practical issue relevant for a given business activity into a question that may be addressed via tools and methods of data analytics, and then apply the results of the analysis for decision-making.",
            "exam_format": "Form of assessment: S\nchool assessment\nDuration: 3 hours\nProportion:\n70%\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material: All printed and written supporting material\nForm of assessment:\nDigital home assessment\nDuration: 1 month\nProportion:\n30%\nGrouping:\nIndividual or in pairs\nGrading scale:\nLetter (A - F)\nSupport material: All material is allowed",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Completing\nLOG708 Applied Statistics with SPSS\nis beneficial, however, this prerequisite is not compulsory. Candidates with any background may be accepted."
        },
        {
            "course_code": "IDR210",
            "name": "Adventure Management",
            "learning_outcomes": "Upon successful completion of this course, students should:\nKnowledge\nUnderstand key elements that shape memorable adventure experiences and the management strategies behind them.\nAcquire fundamental knowledge of adventure planning and operational management.\nGain insight into entrepreneurship and innovation practices within the adventure industry.\nUnderstand essential concepts and frameworks for business model innovation in adventure markets.\nDevelop knowledge of sustainability principles crucial for responsible adventure management.\nSkills\nApply knowledge to design and manage new adventure-based tourism products or services.\nImplement effective risk management and sustainability practices in adventure tourism operations.\nEvaluate market trends and consumer demands to identify opportunities in the adventure sector.\nGeneral Competence\nDemonstrate awareness of ethical, legal, and environmental responsibilities in adventure management.\nExhibit the ability to critically assess industry practices and propose innovative solutions.\nCollaborate effectively in teams to plan, develop, and present viable adventure-related business concepts.",
            "exam_format": "Form of assessment:\nReport and presentation of adventure case\nProportion: 4\n0%\nDuration:\n-\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material\nForm of assessment:\nWritten school assessment\nProportion: 60\n%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material",
            "mandatory_assignments": "Mandatory coursework 1:\nExcursion\nAttendance:\nRequired\nComment: Participation in the mandatory excursion is a prerequisite for exam eligibility. Students who do not attend the excursion will not be permitted to take the final exam. Alternative arrangements can be provided in case of e.g. documented illness, must be applied for to Studieleder.\nMandatory coursework 2:\nStudents must participate in all team work activities, and make the contributions that the team has agreed upon in the team contract.",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "IDR305",
            "name": "Introduction to Economics for Sport Management",
            "learning_outcomes": "Knowledge\n:\nCompleting this course the student should be able to:\nUnderstand and apply the most fundamental tools that economists use such as marginal costs and benefits, opportunity costs, supply and demand, game theory, present value of financial assets, etc.\nSkills\n:\nCompleting this course the student should be able to:\nApply insights from economic theory to critically analyze the complexity of the economic environment.\nGeneral competencies\n:\nCompleting this course the student should be able to:\nEvaluate and discuss how insights from economics can be used to develop modern sport institutions.",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n100%\nDuration:\n3 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nCalculator with empty memory + general dictionary in mother tongue/Norwegian/English in paper version",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Basic mathematical skills in algebra and geometry."
        },
        {
            "course_code": "IDR306",
            "name": "Game Theory and Sports Economics",
            "learning_outcomes": "Give an introduction to game theory with ain emphasis on applications within football economics, football strategy and football management. The main objective of the course is hence to show how modern game theory can be applied in football.\nThe student shall after completing the course:\nhave basic knowledge in game theory\nbe able to apply and understand game theoretic applications within sports strategy/economic problems\nbe able to judge (and at least partly) understand and discuss central stregic and economical problems within Norwegian and innternational sport",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n100%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nCalculator with empty memory + general dictionary in mother tongue/Norwegian/English in paper version",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "No special, but some knowledge in economics and mathematics is a benefit."
        },
        {
            "course_code": "IDR501",
            "name": "The organisation and management of sport II",
            "learning_outcomes": "Upon completion of the course students should be able to:\nexplain organization-sociological perspectives on the specificity of sport and sport's relationships and interaction with other organizations in society\nanalyze sports organizations from the perspective of organization theory",
            "exam_format": "Form of assessment:\nSchool exam\nProportion:\n100%\nDuration:\n5 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nNone\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:55 PM",
            "mandatory_assignments": "Mandatory coursework:\nSeminar-/collection participation\nCourseworks given:\n75%\nCourseworks required:\nPresence:\nRequired\nComment:",
            "recommended_requirements": "IDR100 The Organisation of Sport I, ADM100 Organisasjon I and either ADM201 Innføring i samfunnsvitenskapelig metode or ADM205 Organisasjon II, or similar courses."
        },
        {
            "course_code": "IDR705",
            "name": "Sport History",
            "learning_outcomes": "Knowledge\nCompleting this course the students should be able to:\nunderstand different theories discussing the development of modern sports and its organizations\nunderstand and explain how sport has been shaped and moulded by major political and economic events of the past three centuries\nknow how to apply historical explanations to issues such as gender, race, social class, identity and media in a sport context.\nSkills\nCompleting this course the students should be able to:\napply historical theories to discuss the development of different sports and their organsiations\napply a literature study of international research publications of to analyse and discuss a specific sport historical phenomenon\npresent a historical analysis (both orally and in writing), in an theoretically informed manner.\nGeneral qualifications\nCompleting this course the students should be able to:\nwork independently and in groups in analysing a historical problem\ndiscuss historical phenomena orally in a group session\nrecognize the qualities and the relevance of historical knowledge as part of understanding comtemporary sport\ncritically reflect on the role of sport and its organisations in contemporary society",
            "exam_format": "Form of assessment:\nHome assessment\nProportion:\n100%\nDuration:\n1 weeks\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material",
            "mandatory_assignments": "Mandatory coursework:\nAttendance for teaching\nCourseworks given:\nCourseworks required:\nPresence:\nRequired\nComment:\nAttending guest lectures is mandatory\nMandatory coursework:\nAssignment(s)\nCourseworks given:\n3\nCourseworks required:\n3\nPresence:\nRequired\nComment:\n1 coursework for each seminar. These could be individual written course work, group work and oral presentations.",
            "recommended_requirements": "Same as for the MSc programme in Sport Management"
        },
        {
            "course_code": "IDR710",
            "name": "Philosophy of Science and Research Methods",
            "learning_outcomes": "Knowledge\nStudents who successfully complete the course will be able to:\ndemonstrate knowledge about how research is conducted\nunderstand current perspectives on research in social sciences\nclassify and evaluate scientific contributions from different disciplines within social sciences\nSkills\nStudents who successfully complete the course will be able to:\napply and analyse various theories of science\ndevelop a research question and a research design\nunderstand the relevance and reach of different research methods, both quantitative and qualitative\nbe able to participate in methodology discussions in empirical social sciences\nbe able to evaluate social science research\nGeneral Competences\nStudents who successfully complete the course will be able to:\nemploy the principles of good academic practice\nrelate critically to the choice and application of different research methodologies\ninterpret research findings, draw appropriate conclusions and present those effective with high impact\ndesign meaningful statements and reports for research dissemination by applying key academic skills and competences",
            "exam_format": "Form of assessment:\nClassroom/school exam\nProportion:\n100%\nDuration:\n5 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\n-",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCoursework given:\n5\nCoursework required:\n4\nPresence:\nRequired\nComment:\nFour out of total five coursework assignments are required during the course. Submission of the quantitative coursework assignment is mandatory. The assignments (individual and/or team) will be marked with pass/fail, however, all must be passed in order to advance to the course exam.",
            "recommended_requirements": "Bachelor level introductory course on research methodology.\nIntroductory course on the importance of academic referencing, referencing styles and how to avoid any question of plagiarism."
        },
        {
            "course_code": "IDR804-015",
            "name": "Marketing Digitalization in Sports",
            "learning_outcomes": "The primary course objective is to assist students in gaining the conceptual frameworks, knowledge, and skill sets necessary to develop, implement, and manage digital marketing projects in a dynamic business environment, understand the leadership process of integrating digital technologies into the sport enterprise, and solving complex managerial problems related to digital dimensions of sport businesses.\nOther objectives include (\nLearning outcome: knowledge\n):\nUnderstanding the key technological dimensions of the digital transformation and how they provide a unique sport marketing business perspective, including the principles and procedures associated with effective digitally focused business model innovation (BMI)\nDeveloping conceptual and technical skills related to implementing digital marketing projects in the sport enterprise\nDeveloping an understanding of the functionality of various digital marketing platforms within the sport industry\nIdentifying how digital transformation impacts specific dimensions of sport business, for example, marketing, licensed merchandise sales, public relations, sport venue operations and management, media, etc.\nAt the end of this seminar, students should be able to (\nLearning outcome: skills\n):\nEvaluate relevant theoretical concepts, frameworks, and models related to the digital marketing transformation within sports and sports events\nApply and communicate this understanding to real cases and problems\nAt the end of this seminar, students should be able to (\nLearning outcome: general competences\n):\nInterpret research findings, draw appropriate conclusions and present those effective with high impact\nEmploy the principles of good academic practice\nDesign meaningful statements and reports for research dissemination by applying key academic skills and competences",
            "exam_format": "Form of assessment:\nClassroom/school exam\nProportion:\n100%\nDuration:\n2 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\n-",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCourseworks given:\n2\nCourseworks required:\n2\nPresence:\nRequired\nComment:\nThe course is taught in a continuous block of time over a short period, thus intensive attendance is required. The coursework assignments (individual and/or team) will be marked with pass/fail. Both need to be passed in order to advance to the course exam.",
            "recommended_requirements": "General knowledge of (Sports and Event) Marketing. Students should have successfully completed IDR805 \"Sport and Event Marketing\" or similar, but at least an introductory Bachelor level (sport and event) marketing course."
        },
        {
            "course_code": "IDR804-017",
            "name": "Social Media Marketing in Sport",
            "learning_outcomes": "This intensive attendance course is designed to give students an overview of the concepts, tools, and issues surrounding social media and marketing, using real-case scenarios, examples and applications from the world of sport, in a truly interactive and international learning environment.\nLearning outcome: Knowledge\nThe course aims to answer the question of how sport entities are able to capitalize on the unique and powerful marketing opportunities of social media as well as to understand the challenges that marketing managers face by the growth of the social media phenomenon. On successful completion of this course participants will be able to:\nAppreciate the size, scope and importance of social media in sport and the relevant academic discussion in the field\nUnderstand the role of social media within sport and event marketing\nApply marketing theories and management concepts on the usage of social media withhin the sport and event industry environment\nRecognize potential challenges and identify the newest trends of the use of digital media in the sport and event industry\nLearning outcome: Skills\nAt the end of this course, students should be able to:\nEvaluate relevant theoretical concepts, frameworks, and models related to social media marketing within sports and sport events\nApply and communicate this understanding to real cases and problems\nLearning outcome: General Competences\nAt the end of this course, students should be able to:\nInterpret research findings, draw appropriate conclusions and present those effective with high impact\nEmploy the principles of good academic practice\nDesign meaningful statements and reports for research dissemination by applying key academic skills and competences",
            "exam_format": "Form of assessment:\nClassroom/school exam\nProportion:\n100%\nDuration:\n2 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\n-",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCourseworks given:\n2\nCourseworks required:\n2\nPresence:\nRequired\nComment:\nThe course is\ntaught in a continuous block of time over a short period, thus intensive attendance is required.\nThe coursework assignments (individual and/or team) will be marked with pass/fail. Both need to be passed in order to advance to the course exam.",
            "recommended_requirements": "General knowledge of (Sports and Event) Marketing. Students should have successfully completed IDR805 \"Sport and Event Marketing\" or similar, but at least an introductory Bachelor level (sport and event) marketing course."
        },
        {
            "course_code": "IDR804-019",
            "name": "Sponsorship-linked Marketing",
            "learning_outcomes": "This intensive attendance course is designed to give students an overview of the concepts, tools, and issues surrounding sponsorship-linked marketing, using real-case scenarios, examples and applications from the world of sports and events, in a truly interactive and international learning environment.\nLearning outcome: Knowledge\nHaving completed this course students should be able to:\n• demonstrate a practical understanding of sponsorship\n• evaluate the goals and strategies of the relevant actors who participate in sport sponsorship\n• describe and explain the central concepts, theories and models relating to sport sponsorship\n• identify and critically discuss sport sponsorship tasks and problems and develop conceptual solutions by means of state-of-the-art theories and management tools\n• critically analyse the advantages and disadvantages of various types of sponsorships\n• discuss, criticize, and evaluate practical issues and problems in the area of sport sponsorship\nLearning outcome: Skills\nAt the end of this course students should be able to:\n• understand relevant theoretical concepts, frameworks, and models related to sponsorship-linked marketing activities\n• apply and communicate this understanding to real-world cases and problems\nLearning outcome: General Competences\nAt the end of this course students should be able to:\n• interpret research findings, draw appropriate conclusions and present those effective with high impact\n• employ the principles of good academic practice\n• design meaningful statements and reports for research dissemination by applying key academic skills and competences",
            "exam_format": "Form of assessment:\nClassroom/school exam\nProportion:\n100%\nDuration:\n2 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\n-",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCourseworks given:\n2\nCourseworks required:\n2\nPresence:\nRequired\nComment:\nThe course is\ntaught in a continuous block of time over a short period, thus intensive attendance is required.\nThe coursework assignments (individual and/or team) will be marked with pass/fail. Both need to be passed in order to advance to the course exam.",
            "recommended_requirements": "General knowledge of (Sports and Event) Marketing. Students should have successfully completed IDR805 \"Sport and Event Marketing\" or similar, but at least an introductory Bachelor level (sport and event) marketing course."
        },
        {
            "course_code": "IDR806-001",
            "name": "The Social Responsibility of Sport Organisations",
            "learning_outcomes": "Knowledge:\nCompleting this course the student should be able to:\nUnderstand the principles of ethics and integrity\nIdentify ethical, social, and environmental challenges in the world of business and sport\nUnderstand the sustainability dimension of ethical decision-making\nUnderstand the background of corporate social responsibility (CSR) and the local, European and global contexts in which CSR is currently developing\nSkills:\nCompleting this course the student should be able to:\nApply ethical frameworks to problems in international sports business\nApply CSR theories and frameworks to analyse organisational challenges to evaluate different scenarios in practice, with a view to propose recommendations for the organisation.\nGeneral competencies:\nCompleting this course the student should be able to:\nEvaluate and discuss how insights from the course can be used to develop modern sport institutions.",
            "exam_format": "Form of assessment:\nHome assessment\nProportion:\n100%\nDuration:\n--\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material",
            "mandatory_assignments": "Mandatory coursework:\nAttendance for teaching\nCourseworks given:\nCourseworks required:\nPresence:\nRequired\nComment:\nAttendance to all seminars is compulsory\nMandatory coursework:\nAssignment(s)\nCourseworks given:\n3\nCourseworks required:\n3\nPresence:\nRequired\nComment:\nIn each seminar there will be group and/or individual course work (not graded). Participation/contribution to the in-class course work is mandatory as it constitute a prerequisite for taking the exam.",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "IDR806-002",
            "name": "The Nordic Sports Models",
            "learning_outcomes": "Completing this course the students are expected to be able to:\nDescribe and understand the political structures governing voluntary,non-profit and membership-based club sport in Scandinavia.\nRecognize the fundamental organizing principles of voluntary, non-profit and membership-based club sport in Scandinavia.\nCritically assess key governance phenomena in voluntary, non-profit and membership-based club sport in Scandinavia and their implications for sport federations, sport clubs, and participants",
            "exam_format": "Form of assessment:\nHome assessment\nProportion:\n100%\nDuration:\n--\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material",
            "mandatory_assignments": "Mandatory coursework:\nAttendance for teaching\nCourseworks given:\nCourseworks required:\nPresence:\nRequired\nComment:\nAttendance to all seminars is compulsory\nMandatory coursework:\nAssignment(s)\nCourseworks given:\n3\nCourseworks required:\n3\nPresence:\nRequired\nComment:\nIn each seminar there will be group and/or individual course work (not graded). Participation/contribution to the in-class course work is mandatory as it constitute a prerequisite for taking the exam.",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "IDR806-003",
            "name": "Sport Analytics",
            "learning_outcomes": "Upon successful completion of this course, students will be able to:\nUse STATA software to apply statistical techniques effectively.\nAchieve a thorough understanding of various regression models.\nDetermine the appropriate model for their specific research questions.\nUtilize advanced techniques to develop state-of-the-art identification strategies.\nAcquire the knowledge, skills, and experience necessary to conduct empirical research",
            "exam_format": "Form of assessment:\nHome assessment\nProportion:\n100%\nDuration:\n--\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material",
            "mandatory_assignments": "Mandatory coursework:\nAttendance for teaching\nCourseworks given:\nCourseworks required:\nPresence:\nRequired\nComment:\nAttendance to all seminars is compulsory\nMandatory coursework:\nAssignment(s)\nCourseworks given:\n3\nCourseworks required:\n3\nPresence:\nRequired\nComment:\nIn each seminar there will be group and/or individual course work (not graded). Participation/contribution to the in-class course work is mandatory as it constitute a prerequisite for taking the exam.",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "IDR806-004",
            "name": "Economic Behaviour in Sport",
            "learning_outcomes": "Knowledge:\nCompleting this course the student should be able to:\nExplain how knowledge about economic behaviour can be applied in sport institutions.\nSkills:\nCompleting this course the student should be able to:\nApply insights from economics to critically consider alternative ways to manage sport institutions.\nGeneral competencies:\nCompleting this course the student should be able to:\nEvaluate and discuss how insights from economics can be used to develop modern sport institutions.",
            "exam_format": "Form of assessment:\nHome assessment\nProportion:\n100%\nDuration:\n--\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:51 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "IDR910",
            "name": "Internship",
            "learning_outcomes": "Knowledge:\nCompleting this course you should be able to:\ndemonstrate enhanced career knowledge\nhave an understanding of working tasks as part of the broader organizational context\nSkills:\nCompleting this course you should be able to:\nshape a well formulated motivational letter and CV\ndemonstrate work related skills\ncritically plan and evaluate the internship learning process\nGeneral competence:\nCompleting this course you should be able to:\nrelate academic theory to practical work",
            "exam_format": "Form of assessment:\nPortfolio assessment\nProportion:\n%\nDuration:\n-\nGrouping:\n-\nGrading scale:\nPass/fail\nSupport material:\n-\nIn order to pass the course the students must have all three course works satisfactory approved.",
            "mandatory_assignments": "Mandatory coursework:\nAssignment\nCourseworks given:\n1\nCourseworks required:\n1\nPresence:\nRequired\nComment:\nIn advance of the internship, you must submit a learning agreement - a signed contract between yourself, the internship organization and the course responsible. A learning agreement template is available for students via Canvas.\nMandatory coursework:\nTutorials\nCourseworks given:\n1\nCourseworks required:\n1\nPresence:\nRequired\nComment:\nYou must initiate and organize a mid-evaluation meeting with all the parties of the agreement attending. The meeting will take place at the internship placement unless otherwise agreed.\nMandatory coursework:\nReport\nCourseworks given:\n1\nCourseworks required:\n1\nPresence:\nRequired\nComment:\n​​You must submit a final report after the internship period. The final report should describe the overall learning experience from your perspective, and must be both descriptive and analytic. The report must be submitted as a video file. Total time of the presentation should be 10 minutes.The video can be combined with a Power Point presentation.",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "IDR950",
            "name": "Master`s Degree Thesis",
            "learning_outcomes": "After completing the thesis the student will be able to:\nKnowledge\n:\ncritically and systematically integrate knowledge from courses in the Sport Management programme\nanalysing, assessing and dealing with complex phenomena, issues and situations even with limited information\nSkills:\nidentify and formulate issues independently and creatively\nplan and use appropriate research methods within a predetermined time frame. This includes assessments with regard to scientific and ethical aspects, and awareness of the ethical aspects of research work, including the limitations of research, its role in industry/society and the responsibility of the individual for how it is used.\nGeneral competencies:\nproficiency in academic writing and in communicating the research results.",
            "exam_format": "Form of assessment:\nWritten master's thesis with oral defence\nProportion:\n100%\nDuration:\n-\nGrouping:\n-\nGrading scale:\nLetter (A - F)\nSupport material:\n-\nThe final grade is a combination of grades received on the thesis and the oral presentation. The final grade is mainly based on the written assignment, but performance on the oral exam might adjust the final grade slightly. There is no fixed percentage distribution between the assignment and the oral exam. Only one final grade will be presented to the student.\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:51 PM",
            "mandatory_assignments": "Mandatory coursework:\nOther - please specify in the comments\nCourseworks given:\n1\nCourseworks required:\n1\nPresence:\nRequired\nComment:\nMaster Thesis project proposal.\nThe proposal must contain:\nTitle of the thesis project and name of student(s).\nAn introduction to the research problemI.Legitimate your research problem to the ‘real world’ or to a gap in scientific research.\nDefine the goal of the research in terms of a clear statement of the problem.\nDevelop a first draft of the main research question.\nBackground (describe your case and/or important factors to understand the context).\nInitial literature review (main authors, theories and methods applied, sample characteristics, limitations, key results) followed by the development of a basic research framework.\nMethodology\nWhat kind of research methodology do you plan to use for your study.\nWhat will be your data collection strategy?\nDevelop a time-line for your thesis project.\nRecommended: 1500-2000 words (ca. 3-5 pages, including references and time-line).",
            "recommended_requirements": "Only those students who are enrolled in the MSc programme in Sport Management can write a Sport Management Master’s Degree Thesis. Each candidate must have an approved Master’s Thesis proposal. Submission of the Master’s Degree Thesis cannot be accepted if the student has not completed all previous courses in the Sport Managements programme."
        },
        {
            "course_code": "LOG206",
            "name": "Digital Business Management",
            "learning_outcomes": "Knowledge\nAfter completing this course, a student who fully engages with the course activities shall have knowledge about:\n•Basic principles of business and their application to digital business.\n•Relevant technology solutions for digital business\n• Approaches to developing digital business strategy\n• Essential elements of digital transformation\n• The role of digital technologies in enhancing social, environmental and economic sustainability\nSkills\nAfter completing this course, a student who fully engages with the course activities shall be able to:\n• To examine a business model\n• To innovate a business model\n• To select suitable technology solutions for digital business\n• To develop an effective digital business strategy\n• To management digital transformation\nGeneral competencies\nAfter completing this course, a student who fully engages with the course activities shall have the following competencies:\n•ability to analyse business problems\n•ability to evaluate and make informed decisions\n•ability to reflect on tasks and create an action plan",
            "exam_format": "Part one\nForm of assessment:\n- Digital home assessment - Inspera\nProportion:\n30%\nDuration:\n2 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\n-\nPart two\nForm of assessment:\nDigital home assessment - Inspera\nProportion:\n70%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\n-",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "None"
        },
        {
            "course_code": "LOG400",
            "name": "Logistics Planning in the Energy Sector",
            "learning_outcomes": "After completing this course, the candidates will\nKnowledge:\nhave general knowledge of energy logistic networks and infrastructures in energy sector.\nhave knowledge of industry-specific logistics planning problems.\nhave an overview of approaches for planning within upstream, midstream, and downstream parts of energy logistics networks.\nhave knowledge of purchasing and supplier selection, warehousing and inventory management, and transportation planning specific to the energy industry.\nSkills:\nunderstand various contexts in energy logistics infrastructures and logistical network design.\nunderstand various contexts for an efficient mobilization of the flows within the industry’s infrastructures and networks.\nbe able to reflect on the interplay between the various logistical issues and challenges.\nGeneral competences:\nbe able to communicate problem settings in the energy industry.\nhave an understanding of the industry sector from the logistical viewpoint of effective and efficient planning and coordination of logistical activities",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n100%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material",
            "mandatory_assignments": "Mandatory coursework: Assignment(s)\nCourseworks given:1\nCourseworks required: 1\nComment: Several questions will compose one home assignment. The assignment questions are based on exercises in the computer lab thus it is mandatory to be present during data lab hours.The required assignment may be solved in groups. Mandatory coursework requirements must be approved in order to be allowed to take the final exam. Work requirements must be completed in the same semester as when the course is taught, and then give access to the ordinary exam. Approved coursework requirements also give access to the first retake exam if such an exam is arranged. Coursework requirements are no longer valid in the future semesters. It means that students who take the course again, must do the mandatory coursework requirement again.",
            "recommended_requirements": "none"
        },
        {
            "course_code": "LOG410",
            "name": "Offshore Energy Logistics",
            "learning_outcomes": "After completing this course, the candidates will\nKnowledge:\nknow the history and the currents development of the offshore energy industry at NSC\nan overview of the offshore energy value chain\nan overview of offshore energy logistics challenges\nknowledge of logistics operations within offshore supply, cargo and offshore personnel transportation, offshore support operations, and emergency preparedness and response.\nknowledge of the trends in offshore energy logistics.\nSkills:\nbe able to understand various contexts and identify challenges of offshore energy logistics\nbe able to perform main activities and tasks in offshore energy logistics operations\nbe able to apply the knowledge in practical cases\nGeneral competences:\nbe able to communicate logistics problem settings in offshore energy context\nhave an understanding of the offshore energy logistics from the practical viewpoint\ncan plan and carry out varied tasks within logistics planning\nbe familiar with new thinking and innovation processes within logistics planning offshore.",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n100%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written aids",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCourseworks given:\n1\nCourseworks required:\n1\nComment: One group assignment. The required assignment may be solved in groups. Mandatory coursework requirements must be approved in order to be allowed to take the final exam. Work requirements must be completed in the same semester as when the course is taught, and then give access to the ordinary exam. Approved coursework requirements also give access to the first retake exam if such as exam is arranged. Coursework requirements are no longer valid in future semesters. It means that students who retake the course must do the mandatory coursework requirement again.",
            "recommended_requirements": "none"
        },
        {
            "course_code": "LOG500",
            "name": "Management models in logistics",
            "learning_outcomes": "Knowledge:\nThe student should know about:\n- Different forecasting models for static, trend-based and seasonal-based demand.\n- Aggregated production planning\n- Principles for inventory management for deterministic and stochastic demand.\n- Production philosophies JIT (Just in Time) and MRP (Materials Requirements Planning).\n- Scheduling of operations for meeting different priorities.\nSkills:\nThe student should be able to:\n- Use forecasting techniques like regression and exponential smoothing.\n- Create aggregated production plans.\n- Calculate order sizes and frequencies in cases with deterministic demand.\n- Calculate order sizes and safety stock in cases with stochastic demand.\n- Use classical heuristics for estimating lot sizes.\n- Use simple scheduling rules for operation meeting different objectives.\nGeneral competence:\nThe student should be able to analyze problems appearing in different parts of the supply chain of a company, and use classical models to solve such problems.",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n80%\nDuration:\n5 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material + calculator that may contain data\nForm of assessment:\nHome assessment\nProportion:\n10%\nDuration:\n4 weeks\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material + calculator that may contain data\nForm of assessment:\nHome assessment\nProportion:\n10%\nDuration:\n4 weeks\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material + calculator that may contain data",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCourseworks given:\n1\nCourseworks required:\n1\nPresence:\nNot required\nComment:",
            "recommended_requirements": "Basic economics or logistics education. Courses similar to SCM200 - Inventory and production management. It is an advantage to be able to use Excel spreadsheets in order to solve assignments and partial exams."
        },
        {
            "course_code": "LOG510",
            "name": "Value Chain Analysis",
            "learning_outcomes": "Knowledge:\nAfter passing the course, the student will have knowledge about:\nkey theories that explain differences in firm performance\ntrade-offs involved in value chain management and the need for value chain adaptation\nthe impact of individual components of a value chain on firm performance\nvolatility, uncertainty, complexity and ambiguity affecting value chains and how they should be managed\nSkills:\nAfter passing the course, the student should be able to:\nidentify problems in value chains\nsolve problems in value chains\ncoordinate with others in a value chain setting\nGeneral competence:\nAfter passing the course, the student should have the following competencies:\nability to develop strategies and execute plans\nability to reflect on own practice and develop strategies for improvement\nability to solve problems in cooperation with others (collaborative problem solving)",
            "exam_format": "Form of assessment:\n-\nProportion:\n50%\nDuration:\n1 semester\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupport material:\n-\nForm of assessment:\nSchool assessment\nProportion:\n50%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nOnly general dictionary in mother tongue/Norwegian/English in paper version\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:20 PM",
            "mandatory_assignments": "Compulsory work requirement: Assignment\nNumber of work requirements: 1\nRequired work requirements: 1",
            "recommended_requirements": "Basic knowledge of supply chains, production planning and purchasing\nIt is an advantage to have had SCM120 Principles in value chain management, as the course uses the same simulation tool, but you can take the course without SCM120. Value chain analysis is an advanced version of SCM120 where more advanced modules are used in the simulation tool.\nBasic knowledge of statistics (e.g., MAT110 Statistics 1) is an advantage."
        },
        {
            "course_code": "LOG525",
            "name": "Quality Management/Management for Change",
            "learning_outcomes": "The course will give an introduction to important principles in Total Quality Management (TQM) and LEAN. Total Quality Management and LEAN are philosophies with accompanying basic principles, models and tools. Introduction to the philosophy requires foundations in cultural and organizational change. Central elements of the course are to understand which changes are required and how can they be implemented. TQM and LEAN are central elements in organizations that strive for continuous improvement. The course will also introduce other change models with a starting point in value chain analysis and the meaning of these will be reviewed.\nThe successful candidate shall with completion of this course:\nHave knowledge in the subject area.\nCan evaluate the appropriateness and application of various philosophies and methods in the design of of quality management framework.",
            "exam_format": "Form of assessment: Digital home assessment - Inspera\nProportion: 100 %\nGrouping: Individual\nGrading scale: Letter (A - F)\nSupport material: All printed and written supporting material",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCourseworks given:\n1\nCourseworks required:\n1\nPresence:\nNot required\nComment: Pass/Fail",
            "recommended_requirements": "No special prerequisites, but participants should have completed LOG510 Value Chain Analysis"
        },
        {
            "course_code": "LOG530",
            "name": "Distribution Planning",
            "learning_outcomes": "Knowledge:\nThe student should have knowledge of\n·         Transportation and transshipment situations\n·         Discrete localization and network problems\n·         Allocation problems\n·         Classical network problems, such as the Postman Problem, the Travelling Salesman Problem and the Minimal Span Problem.\nSkills:\nThe student should be able to recognize different types of distribution problems described in the literature, to formulate such problems mathematically and to solve them using computer software.\nGeneral competence:\nThe student should be able to comprehend and apply simple models for distribution planning problems.",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n60%\nDuration:\n5 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material + calculator that may contain data\nForm of assessment:\nHome assessment\nProportion:\n20%\nDuration:\n1 weeks\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material\nForm of assessment:\nHome assessment\nProportion:\n10%\nDuration:\n4 weeks\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material + calculator that may contain data\nForm of assessment:\nHome assessment\nProportion:\n10%\nDuration:\n4 weeks\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material + calculator that may contain data\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:37 PM",
            "mandatory_assignments": "Mandatory coursework:\nExercises\nCourseworks given:\n2\nCourseworks required:\n2\nPresence:\nNot required\nComment:",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "LOG560",
            "name": "Project Management",
            "learning_outcomes": "Knowledge\nOn completion of the course, the student the student will have knowledge about:\nKey project management theories and frameworks.\nThe project life cycle and phases.\nProject Management triangle\nRisk management and mitigation strategies.\nProject planning tools and their application in project execution\nSkills\nOn completion of the course, the students should be able to:\nDevelop comprehensive project plans.\nManage project resources effectively.\nMonitor and control project progress.\nCoordinate with team members and stakeholders to achieve project objectives.\nGeneral Competence\nOn completion of the course the student should have the following competencies:\nAbility to develop and implement project strategies.\nReflect on project management practices and identify areas for improvement.\nSolve project-related problems collaboratively and effectively.",
            "exam_format": "Form of assessment:\nSchool exam\nShare:\n100%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter grade (A - F)\nAids:\nCalculator with empty memory+general dictionary mother tongue/Norwegian/English in paper forma",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "No special knowledge required."
        },
        {
            "course_code": "LOG570",
            "name": "Research Methods",
            "learning_outcomes": "Learning outcomes\nAfter completion of the course, the students will be able to:\nKnowledge\nunderstand different types of qualitative research and their importance in logistics.\nhave an insight into the main principles of qualitative research in logistics.\ngain knowledge of various qualitative data collection techniques.\nlearn about qualitative data analysis techniques.\nunderstand ethical considerations and challenges associated with conducting research.\nSkills\ndesign and conduct effective interviews and focus groups.\ngain hands-on experience in analysing qualitative data.\nenhance their critical thinking by evaluating qualitative research studies.\ncarry out a simple, limited research or project in line with current research ethics norms.\ncommunicate about academic issues, analyses and conclusions.\nCompetence\napply qualitative methods to real-world logistics challenges.\ncommunicate and discuss research in a clear-cut manner\n.\ndiscuss and raise questions about methodological issues that are relevant to their dissertations and thereby develop their own research projects.",
            "exam_format": "The assessment structure consists of two parts: a folder (40%) and a written exam (60%). Students are required to prepare two group assignments that will be compiled in the designated folder. It is important to note that the group assignments contribute to the overall assessment, with all members of each group receiving the same grade. Additionally, a take-home exam involving proposal writing and presentation is included. Both components must be successfully completed to pass the course.\nExamination 1\nForm of assessment: Continuous assessment (folder)\nProportion: 40 %\nDuration:\nOne semester\nGrouping: Group\nGrading scale:\nLetter (A - F)\nSupport material: The slides, books and articles used during the course will be uploaded on Canvas.\nExamination 2\nForm of assessment: Home Exam\nProportion: 60 %\nDuration:\nOne semester\nGrouping: Individual or in groups of two people\nGrading scale:\nLetter (A - F)\nSupport material: The slides, books and articles used during the course will be uploaded on Canvas.",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "LOG708",
            "name": "Applied Statistics",
            "learning_outcomes": "After finishing the course, the students should achieve the following learning outcomes\nSkills:\n​\nuse basic probability distributions for simple modeling and to find probabilities and moments\nuse statistical software to effectively organize and present information extracted from data\nperform simple and multiple regression analysis with statistical software\nKnowledge\n​\nabout the theory of random variables, probability distributions and their use in statistical analysis\nabout the theory of statistical hypothesis testing\nabout basic regression analysis\nGeneral competence\n​\ngive practical interpretations and present the results of statistical analyses in nontechnical terms\nunderstand the role of statistics as a tool for gaining scientific knowledge, and as a tool for planning and decision support",
            "exam_format": "Form of assessment:\nSchool exam\nProportion:\n60%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material + calculator that may contain data\nForm of assessment:\nHome Exam\nProportion:\n40%\nDuration:\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written material",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCourseworks given:\n2\nCourseworks required:\n2",
            "recommended_requirements": "A standard bachelor's level course in statistics is a highly recommended prerequisite. An intensive introduction (or fresh-up) course will be offered at the start of the semester."
        },
        {
            "course_code": "LOG711",
            "name": "Supply Chain Management I",
            "learning_outcomes": "Knowledge:\nThe successful candidate should:\nhave advanced knowledge of basic theories and concepts applied in SCM\nhave in depth knowledge of contemporary SCM problems\nknow relevant management techniques/strategies in manufacturing and service supply chains\nknow state of the art research problems/industry initiatives\nSkills:\nThe candidate is able to:\napply knowledge in SCM in business or public organizations\nto use and analyze existing literature and research within the field of SCM\nto apply existing theory and models in SCM on present problems\ncarry out an independent, limited research or development project under supervision and in accordance with applicable norms for research ethics\nGeneral competence:\nto analyze problems related to SCM\nto apply knowledge within SCM on all kind of business or public organizations\nto identify new and existing problems within SCM\nto communicate about academic issues, analyses and conclusions in SCM, both with specialists and the general public",
            "exam_format": "Form of assessment:\nSchool exam\nProportion:\n100%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupported material:\nCalculator, dictionary to/from native language - English",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCourseworks given:\n1\nCourseworks required:\n1\nPresence:\nRequired\nComment:",
            "recommended_requirements": "Equivalent to requirements for the MSc programme in Logistics.\nNorske studenter uten forkunnskaper i grunnleggende aspekter av SCM/OM anbefales å gjøre seg kjent med pensum for emnet SCM200 - som finnes\nher\n."
        },
        {
            "course_code": "LOG713",
            "name": "Models for Production Management",
            "learning_outcomes": "Knowledge\nAt the end of the course, the student should be able to\nsummarize different levels of production planning and control, and describe which decisions are made at each level\nprovide a detailed overview of aggregated production planning and materials requirement planning\nexplain the concepts of just-in-time, kanban, optimized production technology, and the theory of constraints\ndefine the lot-sizing problem, the line balancing problem, and several different machine scheduling problems\noutline the meaning of Little’s law and how it relates to throughput, cycle time, and inventory levels in a factory or production line\nSkills\nAt the end of the course, the student should be able to\ncreate aggregated production plans based on the chase strategy or the level strategy\ncreate MRP records based on verbal descriptions\napply heuristics and the Wagner-Within method to solve lot-sizing problems\napply basic sequencing rules for single machine scheduling\ncalculate best case, worst case, and practical worst case performance for cycle time and throughput of a given production line\nexecute a heuristic to solve line balancing problems for production lines\nGeneral competence\nAt the end of the course, the student should be able to\nevaluate the suitability of models and solution methods for production planning problems",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n100%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nCalculator with empty memory + general dictionary in mother tongue/Norwegian/English in paper version",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCourseworks given:\n2\nCourseworks required:\n2\nPresence:\nNot required\nComment:",
            "recommended_requirements": "None, apart from being a master student in logistics accepted into the Logistics Analytics variant."
        },
        {
            "course_code": "LOG715",
            "name": "Business Cases in SCM",
            "learning_outcomes": "This course is primarily skill-oriented, and therefore, the delivery of new theories and concepts will be somewhat limited. Instead, the focus of the course is on development of skills of applying the knowledge of theories and methods studied in the first semester and the ongoing semester of the MSc in Logistics to solve practical challenges presented by the industry.\nKnowledge\nUpon completing this course, the candidate:\nwill have in-depth knowledge of supply chain problems and complexity of real-life logistical challenges that faced by the invited companies.\nSkills\nUpon completing this course, the candidate:\nwill be able to apply the knowledge of supply chain theories and concepts theory to solve real-life case companies problems in logistics.\nwill be able to identify the specifics of the business processes and activities presented in the form of a company case.\nwill be able to identify and solve the logistical challenges the companies are facing.\nwill be able to come up with comprehensive and meaningful suggestions on resolving these practical challenges presented in the form of company cases.\nwill be able to critically analyze the scientific literature relevant to the presented problems, figure out how well-discussed the problems at hand are, and which methodologies the existing literature suggests in order to address certain aspects of the real-life company cases.\nwill be able to communicate the solution proposal and the results in a form of a report which follows the rules of academic writing.\nGeneral competence:\ncan apply the knowledge and skills to identify, analyze, and solve supply chain problems.\ncan communicate the results of the conducted analysis and conclusions both to the specialists and general public.\ncan contribute to critical thinking regarding the discourse on modern-day solutions and approaches to supply chain management, sustainability and logistics.",
            "exam_format": "Form of assessment:\nPortfolio assessment\nProportion:\n100%\nDuration:\n1 semester\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material.\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:37 PM",
            "mandatory_assignments": "Mandatory coursework:\nOther - please specify in the comments\nCourseworks given:\n3\nCourseworks required:\n3\nPresence:\nRequired\nComment:\nDuring the semester, the students will be asked to submit the drafts of their answers to each task within a specified deadline (about one month from the case presentation), and then a feedback will be provided by the course instructor. This submission constitutes to mandatory coursework requirement: these reports must be handed in within the specified deadline, after which the submission is void and the work will not count as passed. Also, attendance of the company presentations and the Q&A sessions is mandatory. If a candidate fails to attend a certain activity, the work corresponding to that case will not count as passed.",
            "recommended_requirements": "LOG711 Supply Chain Management 1 or equivalent course."
        },
        {
            "course_code": "LOG718",
            "name": "Preparatory Course in Basic Statistics",
            "learning_outcomes": "Not specified",
            "exam_format": "Not specified",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "LOG722",
            "name": "Inventory Management",
            "learning_outcomes": "Knowledge\nThe student should have knowledge of:\nDifferent types of inventory management problems and corresponding decisions about order sizes, order frequencies, safety stock and service level\nCosts related to ordering, holding inventory and stock-outs\nInventory management systems\nDeterministic versus stochastic demand, one period versus multiple period inventory management\nABC analysis and how these categories affects inventory management\nSkills\nThe student is able to:\nCalculate optimal order sizes based on the basic EOQ model and the most common extensions of this model\nCalculate order size and expected profit for one-period inventory problems (The Newsboy Problem)\nCalculate safety stock and safety factor for inventory management problems with stochastic demand, with different types of service levels and stockout costs\nGeneral competence\nThe student can:\nComprehend and apply models, formulas and solution methods for various types of inventory management problems.",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n100%\nDuration:\n5 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nCalculator that may contain data + general dictionary in mother tongue/Norwegian/English in paper version",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCourseworks given:\n2\nCourseworks required:\n2\nPresence:\nNot required\nComment:",
            "recommended_requirements": "The same as for the MSc program in logistics"
        },
        {
            "course_code": "LOG725",
            "name": "Transportation and Distribution",
            "learning_outcomes": "After completing the course, the students will have knowledge of:\n• Logistics as a subject area and as a profession\n• Logistics history and its current development\n• Logistics systems and networks\n• Typical planning problems in transportation and distribution\n• Simple optimization algorithms for solving by hand small size problems\n• Principles how to formulate planning problems as optimization models\n• Standard modeling language software (AMPL) for writing models and numerical data for key parameters as computer files in text editor (TexPad) for solving optimization problems with standard solvers (CPEX, MINOS)\n• Procedure to make economical interpretation of solution and theory how to perform post-optimal and sensitivity analysis of solution using output data from solver\nAfter completing the course, the student will be able to apply the knowledge (skills):\n• to define the type of logistics network and the class of transportation or distribution planning problem on the network\n• to identify based on a verbal description problem’s input parameters, decision variables, performance/quality\nindicators, and their relationships and dependencies\n• to solve problems of small size using simple optimization algorithms by hand\n• to give precise formulations of planning problems as optimization (mathematical programming) models\n• to enter problems formulation (in form of optimization model) and numerical data for parameters as inputs to standard software and use the software to obtain solutions\n• to formulate appropriate command files for solver to output data for economical interpretation and parametric and sensitivity analysis of solutions\nAfter completing the course, the students will be able:\n• to identify structures of different logistics systems and types of transportation and distribution planning problems arising on logistics networks in study and work contexts\n• to perceive logical relationships, dependencies, process structures, assumptions and limitations to formulate real planning problems arising in transportation and distribution as optimization models\n• to use knowledge which algorithms and models are appropriate for solution of different planning problems in transportation and distribution\n• to use skills to solve the transportation and distribution planning problems with simple optimization algorithms and with standard software\n• to use skills in performance of parametric and sensitivity analysis to respond in an optimal way to novel situations\n• to criticize the advantages and disadvantages of using algorithms and the standard software for solving practical transportation and distribution planning problems",
            "exam_format": "Form of assessment:\nOral school assessment\nProportion:\n100 %\nDuration:\n-\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and wirtten aids.",
            "mandatory_assignments": "Mandatory coursework: Assignment(s)\nCourseworks given: 5\nCourseworks required: 5\nPresence: Not required\nKommentar: Individual submissions. All assignemnts should be submitted to be admitted to final exam.",
            "recommended_requirements": "A quantitative background is recommended."
        },
        {
            "course_code": "LOG733",
            "name": "Exact Optimization Methods in Logistics",
            "learning_outcomes": "Knowledge\nAfter completing this course, the students should be able to:\ndescribe a taxonomy for mathematical models based on the demarcation between static and dynamic models, linear and nonlinear models, integer and continuous variables, and deterministic and stochastic models\ndefine the following objects from linear algebra: scalars, vectors, and matrices\ndefine the following operations from linear algebra: scalar/dot/inner products, addition, and multiplication of matrices, and taking the transpose and the inverse of a matrix\nexplain four assumptions of linear programming problems: proportionality, additivity, divisibility, and certainty\nexplain the relationship between the primal and the dual of a linear programming problem\ndescribe the principles of dynamic programming\nSkills\nAfter completing this course, the students should be able to:\nrepresent a system of linear equations using matrix notation, and solve systems using the Gauss-Jordan method\nrepresent and solve linear programming problems with two variables using the graphical method\nreformulate a linear programming problem to standard form and augmented form\nexecute the simplex algorithm in tabular form to solve linear programming problems\nfind the dual of a linear programming problem\nperform sensitivity analyses for linear programming problems to calculate the effects of changes in objective function coefficients and right-hand side coefficients\nsolve integer programming problems and binary integer programming problems using branch-and-bound with LP-relaxations being solved using the (dual) simplex method\nsolve binary integer programming problems using implicit enumeration\ngenerate Gomory cuts and solve integer programming problems using a cutting plane algorithm\nformulate and solve deterministic problems using dynamic programming\nGeneral competence\nAfter completing this course, the students should be able to:\nwork independently or in small groups to solve tasks that require patience, a high degree of precision, and the ability to conduct and verify numerical calculations",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n100%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nCalculator with empty memory + general dictionary in mother tongue/Norwegian/English in paper version\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:37 PM",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCourseworks given:\n2\nCourseworks required:\n2\nPresence:\nRequired\nComment:\nThere will be two mandatory assignments, both needs to be passed in order to take the final exam.",
            "recommended_requirements": "LOG725 Transportation and Distribution is recommended. Some mathematical or quantitative background is needed."
        },
        {
            "course_code": "LOG734",
            "name": "Heuristics in Analytics",
            "learning_outcomes": "Knowledge\nAfter completing this course, the students should be able to:\nexplain the difference between exact algorithms, approximation algorithms, and heuristic algorithms\ndefine what is meant by primal and dual bounds and how they can be obtained\ngive an account of how construction heuristics work, and give examples of known construction heuristics\nexplain what is meant by a greedy construction heuristic, and contrast this with regret based heuristics\ngive an account of how improvement heuristics work, based on the concept of neighborhoods\nstate a definition of metaheuristics, and discuss the different meanings that this term may have\ndescribe and define local search based metaheuristics, including simulated annealing and tabu search\ndescribe and define construction based metaheuristics, including grasp and squeaky wheel optimization\ndescribe and define population based metaheuristics, including genetic algorithms and scatter search\ndiscuss the dangers of using metaphors when working with metaheuristics, and to give an account of the historical significance that metaphors have played for metaheuristics\ndiscuss the concepts of intensification and diversification, and classify known components of metaheuristics in relation to those two concepts\nexplain the concept of matheuristics and to provide examples of how they have been used to solve combinatorial optimization problems\npresent the challenges associated to parameter tuning and how they can be handled, both on-line (hyper-heuristics and robust heuristics) and off-line (using iRace, SMAC, or ParamILS)\ndiscuss how metaheuristics can be analyzed and improved using target analysis and fitness landscape analysis\nSkills\nAfter completing this course, the students should be able to:\ndesign a heuristic to solve a given optimization problem\nevaluate the appropriateness of choices made during the design of the heuristics\nImplement efficient heuristics in a programming language such as C++\nGeneral competence\nAfter completing this course, the students should be able to:\nwork independently or in a small team to write code for scientific computing\ncreate and hold a relevant professional presentation for an audience of peers",
            "exam_format": "Form of assessment:\nThree submissions\nProportion:\n30%\nDuration:\n1 semester\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material\nForm of assessment:\nOral presentation\nProportion:\n20%\nDuration:\n-\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupport material:\n-\nForm of assessment:\nSchool assessment\nProportion:\n50%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nOnly general dictionary in mother tongue/Norwegian/English in paper version\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:37 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "LOG725 Transportation and Distribution is recommended. Some knowledge of exact optimization methods is recommended, for example by taking LOG733 Exact Optimization Methods in Logistics in parallel."
        },
        {
            "course_code": "LOG745",
            "name": "Industrial Organization and Competition Policy",
            "learning_outcomes": "Knowledge\nUpon completing this course, the candidate:\nHas in-depth understanding of strategic interactions of firms with respect to their production and pricing decisions\nHas understanding of why and how companies develop their competitive strategies related to product differentiation, price discrimination, and vertical integration\nHas necessary knowledge and analytical tools to work through case studies of real-life companies\nSkills\nUpon completing the course, the student will be able to:\nStructure and analyze problems within industrial organization by using relevant models\nApply theoretical tools of industrial organization for the analysis of real markets and explain strategic behavior of market participants\nAnalyze and discuss questions related to trade-offs between individual profit-maximization and social welfare\nAnalyze and predict the effect of government measures (tariffs, subsidies) on market prices and quantities, social welfare, and economic efficiency\nGeneral Competence\nUpon completing the course, the student will:\nDevelop an understanding of the relevance of modern economic methodology for real markets\nDevelop a critical approach to the choice of relevant methods and theoretical tools for the analysis of real markets\nUnderstand principles and rationale behind governmental regulation",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n100%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupported material:\nOne A4 sheet with handwritten notes on both sides. Calculator.",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCourseworks given:\n2\nCourseworks required:\n2\nPresence:\nNot required\nComment:\nBoth assignments should be approved to be admitted to the final exam",
            "recommended_requirements": "Basic microeconomics"
        },
        {
            "course_code": "LOG760",
            "name": "Urban Economics",
            "learning_outcomes": "Knowledge\nDuring the course, students are trained in using relevant methods and theories about urban economics. Students must have an understanding of cities as economic units and specialized insight into the economic forces behind the emergence, development and stagnation of cities.\nSkills\nStudents should be able to analyze academic issues about the city as a place and attractiveness using urban economic models. The students should also be able to use welfare economics to evaluate policies that affects urban areas.\nGeneral competance\nStudents are trained to work with practical and theoretical problem solving and convey reasoning orally and in writing.",
            "exam_format": "Form of assessment:\nWritten school assessment\nProportion:\n60%\nDuration:\n4 Hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material + calculator with empty memory\nForm of assessment:\nOral exam\nProportion:\n40%\nDuration:\nSemesters\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\n-",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Knowledge of basic Microeconomics is recommended."
        },
        {
            "course_code": "LOG765",
            "name": "Project Planning and Control",
            "learning_outcomes": "After having completed the course, the candidate should:\nKnowledge\nhave a deep understanding of project work. We aim to teach the basic understanding of the project working model applied analytically as well as proactively to a wide range of situations. This also entails a comprehensive understanding of the challenges and corresponding success factors for project execution.\nhave a broad knowledge of methods and techniques to plan and conduct large projects, based on a systematic and evidence-based approach.\nSkills\nhave a thorough understanding of the tools, methods, and processes for project planning and control, especially to analyze and evaluate project status based on progress information.\nCompetence\nbe able to analyze risk elements in projects and suggest how to deal with them. It will be necessary to be able to create an overview of different stakeholders' interests and responsibility in projects.",
            "exam_format": "Form of assessment:\nWritten school assessment\nProportion:\n100%\nDuration:\n4 Hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nOwn notes on paper / lecture notes on paper + calculator that may contain data + general dictionary in mother tongue/Norwegian/English in paper version",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCourseworks given:\n2\nCourseworks required:\n2\nComment:\nExercises have to be handed in by specified deadlines, after which hand-in is void and the exercise will not count as passed. Exercises need to be carried out in the same semester as the examination.\nThe first assignment is divided into several parts (6-8) that will be given during the semester. All parts must be approved.",
            "recommended_requirements": "Equivalent to the requirements for acceptance to the MSc in Logistics programme. Experience in the use of IT-based tools and some knowledge of statistics are required. Mathematical skills corresponding to higher secondary school's S1 will be needed."
        },
        {
            "course_code": "LOG767",
            "name": "Supply Chain Risk Management",
            "learning_outcomes": "Knowlede\nhave advanced knowledge of key theories, issues and methods within operational risk analysis and operational risk management\nin depth knowledge of SCRM\napply knowledge in SCRM in business or public organizations\nanalyze problems connected to SCRM\nSkills\nbe able evaluate research within SCRM\nto use and analyze existing literature and research within the field of SCRM\nto apply existing theory and models in SCRM on present problems\nGeneral competence:\nto analyze ethical problems related to SRCM\nto apply knowledge within SRCM on all kind of business or public organizations\nto identify new and existing problems within SCRM",
            "exam_format": "Vurderingsform:\nHjemmeeksamen\nAndel:\n100%\nVarighet:\n5 uker\nGruppering:\nGruppe\nKarakterskala:\nBokstavkarakter (A - F)\nHjelpemidler:\nAlle trykte og skrevne hjelpemidler\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:37 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "LOG775",
            "name": "Energy analytics and sustainable technologies",
            "learning_outcomes": "Knowledge\nUpon completing this course, the candidate:\nhas advanced knowledge of the major resources for statistical data on the world energy\nhas advanced knowledge of benefits and drawbacks of various technologies of energy production and transformation, as well as in-depth knowledge of the efficiency, environmental impact, and risks associated with these processes\nhas in-depth knowledge of logistical challenges in the areas of sustainability of energy value chains, energy efficiency, and environment\nhas advanced knowledge of theory, analytical methods, and decision-making approaches in the areas of integrated energy networks / value chains\ncan apply this knowledge to identify and study tendencies and gaps in modern-day academic research\ncan apply this knowledge various problem contexts (geographical, industrial, or social) and problem scales\ncan analyze problems and find solutions to logistical challenges in the energy sector as well as any other business context with respect to the efficiency of energy use and environmental impact.\nSkills\nUpon completing this course, the candidate:\ncan\nnavigate in the major sources of statistical information to procure, systemize, and visualize data\n, and further, draw conclusions on the world energy review\ncan\ncompile an energy review for any given country\n, analyze energy resources (reserves, production, and consumption) in that country, trade movements (exports and imports), analyze the country's energy balance over time, and finally, provide the insight into the trends of energy policy in the given country\ncan\nnavigate major databases of scientific literature on the issues of sustainability and energy efficiency\nto figure out the trends and challenges of the modern-day energy sector, as well as placing the problems of logistics in this context\ncan\ncompose a comprehensive literature review\non the issues of energy value chain performance, energy efficiency, environmental management, and others\ncan\nidentify relevant technologies and energy transformations\nfor various problem contexts and scales: countries, cities, communities / campuses, buildings, etc.\ncan analyze and\nmanage activities related to design and mobilization of integrated energy networks / value chains\nthroughout the lifecycle of the developed solutions by identifying, formulating and solving relevant logistic problems through accepted scientific methods\ncan\nidentify and analyze risks and uncertainty, as well as environmental impact\nof operating various energy networks.\nGeneral competence\nUpon completing this course, the candidate:\ncan apply the knowledge and skills to identify, analyze, and solve industrial and academic challenges with respect to the area of energy use\ncan efficiently communicate the results of the conducted analysis and/or decision-making using the terminology relevant to this academic and industrial area\ncan communicate the results of the conducted analysis and conclusions both to the specialists and general public\ncan contribute to critical thinking regarding the discourse on modern-day solutions and approaches to sustainability, energy efficiency, and environment.",
            "exam_format": "Form of assessment:\nPortfolio assessment\nProportion:\n100%\nDuration:\n1 semester\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Equivalent to the requirements for the MSc program in Logistics."
        },
        {
            "course_code": "LOG776",
            "name": "Economics of Energy Value Chains",
            "learning_outcomes": "Knowledge\nUpon completing this course, the candidate:\nHas an in-depth understanding of energy value chains, from primary energy sources to final consumption, which form a complex interdependent energy system\nHas knowledge of the global markets for petroleum and renewables, and how they are affected by environmental policies\nCan demonstrate knowledge of economic concepts undelying energy production and use\nWill be able to critically assess theoretical models and their usefulness for analysing the real energy markets\nCan analyze and discuss questions related to energy efficiency versus economic efficiency\nSkills\nThe candidate is able to:\nApply theoretical tools of economics to structure and analyze real-life problems related to interactions in energy markets\nApply the methodology of Cost-Benefit Analysis for socio-economic analysis of investments in energy infrastructure\nGeneral competence\nThe candidate can:\nCompehend and presents results from international research on energy markets\nReflect on environmental consequences of energy production and use\nOrientate themselves in the international discourse of the future energy mix\nIdentify relevant academic and non-academic sources for their own studies",
            "exam_format": "Vurderingsform:\nSkoleeksamen\nAndel:\n100%\nVarighet:\n4 timer\nGruppering:\nIndividuell\nKarakterskala:\nBokstavkarakter (A - F)\nHjelpemidler:\nCalculator with empty memory + general dictionary native language/Norwegian/English in paper format",
            "mandatory_assignments": "Obligatorisk arbeidskrav:\nOppgave(r)\nAntall arbeidskrav:\n2\nPåkrevde arbeidskrav:\n2\nFremmøte:\nIkke påkrevd\nKommentar:\nBoth assignments should be submitted and approved in order to be admitted to the final exam.",
            "recommended_requirements": "LOG775 Energy Analytics and Sustainable Technologies and SØK710 Industrial Organization or equivalents to these courses."
        },
        {
            "course_code": "LOG778",
            "name": "Offshore Energy Logistics Planning",
            "learning_outcomes": "Not specified",
            "exam_format": "Form of assessment:\nOral school assessment\nProportion:\n100 %\nDuration:\n-\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written aids.",
            "mandatory_assignments": "Mandatory coursework: Assignment(s)\nCourseworks given: 5\nCourseworks required: 5\nGrouping: Individual or groups\nPresence: Not required\nKommentar: All assignemnts must be submitted to be admitted to final exam.",
            "recommended_requirements": "Transportation and distribution planning, vehicle routing, optimization modeling"
        },
        {
            "course_code": "LOG797",
            "name": "Data driven health Care and AI.",
            "learning_outcomes": "Knowledge\nThe student should have advanced knowledge within:\nThe concepts of AI and its impact on society and daily work tasks.\nRecognize the applications of AI across various domains, including healthcare, logistics, finance, marketing, and education.\nThe ethical considerations and responsible use of AI in real-world settings. Responsible AI principles.\nApply AI tools and techniques to solve practical problems using Python, an accessible programming language.\nUse and understand generative AI tools\nDevelop critical thinking and problem-solving skills through a series of hands-on projects\nSkills\nThe student is able to:\nanalyze and deal critically with various sources of information\nanalyze existing theories and concepts using big data and AI\nwork independently on practical and theoretical problems.\ncan analyze and interpret AI and data driven concepts on a practical level\nGeneral competence\nAfter completing the course, the student can:\nanalyze relevant academic, professional and research ethical problems connected to AI and data driven decisions.\napply his/her knowledge and skills in new areas in order to carry out advanced assignments and projects\ncan communicate extensive independent work connected to AI and data driven healthcare.\ncan communicate about academic issues, analyzes and conclusions in the field, with specialists\ncontribute to new thinking and innovation processes",
            "exam_format": "Assessment & Weighting\nWeekly assignments - 40%\nComplete at least 75% of the assigned exercises.\nGrading: Letter scale AF.\nApplied project - 60%\nEvaluated via a written report describing the applied work performed.\nGrading: Letter scale AF.",
            "mandatory_assignments": "None",
            "recommended_requirements": "Prerequisites: None\nOverview: A hands-on introduction for non-technical health professionals. Learn what AI is, how it works, and how to use it responsibly to analyze data, streamline workflows, and support everyday decisions. By the end, you'll know where AI fits in clinical and administrative routines—and how to get practical value from it."
        },
        {
            "course_code": "LOG820",
            "name": "Vehicle Routing",
            "learning_outcomes": "Knowledge\nAfter completing the course, the students will have knowledge of\n• Routing and scheduling problems in logistics\n• Main groups of vehicle routing problems and their applications in distribution planning\n• Types of arc routing problems and algorithms to solve them\n• Classical Travelling Salesman Problem, its variants, formulations and solution techniques\n• Vehicle Routing problems, its variants, formulations and solution techniques\n• Classical heuristic algorithms for solving by hand small size vehicle routing problems\n• Principles how to formulate vehicle routing problems as optimization models to find solutions using standard software\nSkills\nAfter completing the course, the students will be able to apply the knowledge achieved (skills)\n• to identify based on a verbal description the class and the type of routing problem at hand\n• to solve routing problems of small size using classical construction heuristics\n• to give formulations of routing problems as optimization models\n• to enter problems formulation (in form of optimization model) and numerical data for parameters as inputs to standard software and use the software to obtain solutions\nGeneral competence\nAfter completing the course, the students will be able\n• to identify types of routing planning problems arising in logistics networks, in study and work contexts\n• to perceive logical relationships assumptions and limitations to formulate real routing problems arising in distribution as optimization models\n• to use knowledge which algorithms and models are appropriate for solution of different routing planning problems in logistics\n• to use skills to solve routing planning problems with heuristics and standard software\n• to apply in-depth knowledge of methods and techniques for routing vehicles serving customers in various logistics settings",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n100%\nDuration:\n6 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nSeparate list, see below",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCourseworks given:\n4\nCourseworks required:\n4\nPresence:\nNot required\nComment:\nIndividual submissions.All assignments should be submitted to be admitted to final exam",
            "recommended_requirements": "Equivalent to requirements for the MSc program in Logistics and MSc program in Sustainable Energy Logistics, quantitative background is recommended."
        },
        {
            "course_code": "LOG904-100",
            "name": "Proposal Presentation",
            "learning_outcomes": "Knowledge:\nHow to formulate a research problem\nChoosing relevant theory for a research project\nEvaluating what data material which is necessary for answering the problem on hand\nPlanning and organizing the project considered in the master thesis\nSkills:\nWriting a project plan for a master thesis\nPresenting a research project for an academic audience\nGeneral competence:\nAbility to plan and organize a larger academic project like a master thesis.",
            "exam_format": "Form of assessment:\nHome assessment\nProportion:\n100%%\nDuration:\nsemester\nGrouping:\nGroup\nGrading scale:\nPass/fail\nSupport material:\nAll printed and written supporting material\nForm of assessment:\nOral school assessment\nProportion:\n%\nDuration:\nsemester\nGrouping:\nGroup\nGrading scale:\nIt will not be graded in this topic\nSupport material:\nAll printed and written supporting material",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "LOG904-101",
            "name": "Research Design",
            "learning_outcomes": "Knowledge:\nLearning about research and data collection methods\nLearning how to formulate and structure a problem for a research project\nSkills:\nEnsuring that a study is relevant to the research problem\nEnsuring that a study uses relevant methods and procedures\nProviding a systematic literature search\nUsing proper referencing techniques\nGeneral competence:\nAbility to plan a research project.",
            "exam_format": "Form of assessment:\nHome assessment\nProportion:\n100%\nDuration:\n-\nGrouping:\nIndividual, or a group of maximum 2 persons\nGrading scale:\nPass/fail\nSupport material:\nAll printed and written supporting material",
            "mandatory_assignments": "Mandatory coursework:\nSeminar-/collection participation\nCourseworks given:\nCourseworks required:\nPresence:\nRequired\nComment:\nAll lectures are mandatory",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "LOG904-101",
            "name": "Research Design",
            "learning_outcomes": "Knowledge:\nLearning about research and data collection methods\nLearning how to formulate and structure a problem for a research project\nSkills:\nEnsuring that a study is relevant to the research problem\nEnsuring that a study uses relevant methods and procedures\nProviding a systematic literature search\nUsing proper referencing techniques\nGeneral competence:\nAbility to plan a research project.",
            "exam_format": "Form of assessment:\nHome assessment\nProportion:\n100%\nDuration:\n-\nGrouping:\nIndividual, or a group of maximum 2 persons\nGrading scale:\nPass/fail\nSupport material:\nAll printed and written supporting material",
            "mandatory_assignments": "Mandatory coursework:\nSeminar-/collection participation\nCourseworks given:\nCourseworks required:\nPresence:\nRequired\nComment:\nAll lectures are mandatory",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "LOG904-109",
            "name": "Measuring and Managing Performance in Shipping, Logistics and Supply Chains",
            "learning_outcomes": "Knowledge: Students will be exposed to key theoretical concepts that will be instrumental in developing a comprehensive system for measuring all aspects of an organization’s performance in the shipping, logistics and supply chain contexts.\nThe students will also be provided with in-depth understanding of how to choose key performance indicators and how to use them effectively in a holistic approach that will enable accurate, comprehensive and dynamic management of performance at corporate and departmental level.\nSkills: Students will know how to use theoretical models in applied settings. They will be able to assess the performance measurement needs of supply chains, organizations and departments in shipping and logistics and develop practical and applied systems for measuring and management organizational performance. They course provides opportunities to develop and enhance challenge identification and problem solving in shipping logistics and supply chains and to develop core skills such as communication, negotiation, problem-solving and decision-making abilities.\nGeneral competence: students will be able to improve their abilities to work together in groups, to understand case studies, to devise approaches for the understanding of problems and challenges and apply general management skills to address problems and develop and provide relevant solutions.",
            "exam_format": "Form of assessment:\nIn-class presentations\nProportion:\n30 %\nDuration:\n20-25 minute presentation. Fourth day of the course.\nGrouping:\nindividually assessed\nGrading scale:\nLetter (A - F)\nSupport material:\nNotes will be provided\nForm of assessment:\nGroup assignment\nProportion:\n70%\nDuration:\nDuring the course, submission last day of the course\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupport material:\nnotes will be provided",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "LOG904-110",
            "name": "Integrated Logistics and Operations: Learning Through Games",
            "learning_outcomes": "Knowledge\n: Operations topics including forecasting, pooling, the impact of variability, capacity management, managing bottlenecks, inventory management, managing lead times, and over/under model.\nSkills\n: Learn how to apply concepts in real-life scenarios.\nGeneral competence\n: Learn how to make decisions logically.",
            "exam_format": "Examination\n: Score in games.\nForm of assessment:\nEach game automatically gives the student a score, based on how the student performs.\nProportion:\n70 %\nDuration:\nThe game duration is typically 1 hour.\nGrouping:\nTeams of two students.\nGrading scale:\nPercentage out of 100\nSupport material:\nLecture materials.\nForm of assessment:\nFinal exam.\nProportion:\n30%\nDuration:\n2 hours\nGrouping:\nIndividual\nGrading scale:\nPercentage out of 100\nSupport material:\nLecture materials\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:22 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Students are expected to have basic knowledge of operations and logistics management, however games can be played quite competently using qualitative analysis (good quantitative analysis may further enhance performance)."
        },
        {
            "course_code": "LOG904-114",
            "name": "Game Theory Applied in Logistics",
            "learning_outcomes": "Knowledge:\nUnderstanding of concepts and principles of game-theoretic analysis and their possible applications in the field of logistics.\nSkills:\nUse concepts and principles of game theory to structure and analyse strategic interactions of agents with different objectives and available actions.\nGeneral competence:\nIdentify problems within logistics that can be approached with the toolbox of game theory.",
            "exam_format": "Form of assessment:\nHome assessment without presentation\nProportion:\n40 %\nDuration:\nTo be submitted on Wednesday.\nGrouping:\nGroup (up to two students)\nGrading scale:\nLetter (A - F)\nSupport material:\nForm of assessment:\nHome assessment without presentation\nProportion:\n60%\nDuration:\nTo be submitted on Friday\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupport material:\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:22 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "No specific math is required, but some familiarity with basic probability theory is welcomed. Participation LOG745 Industrial Organization and Competition Policy can be a benefit, but not a prerequisite."
        },
        {
            "course_code": "LOG904-116",
            "name": "Offshore Upstream Logistics",
            "learning_outcomes": "Knowledge\nAfter completing the course, the students will understand the role of CCS in decarbonization strategies of the companies, measurements of CCS efficiency, incentives and obstacles. Students will acquire knowledge of the main carbon capture, storage and utilization (CCUS) technologies, including supply chain stages of CO2 capture, transportation and storage. Students will get familiarized with the main supply chain configuration types and current research focus, including techno-economical assessment for technology choice and optimization methods for network design.\nAfter completing the course, the students will know about historical development and trends in offshore wind production, current advantages and disadvantages, offshore wind farm examples, offshore wind turbines components, logistical challenges when designing, scheduling installation and performing maintenance of offshore wind farms, as well as logistical resources used. The students will have knowledge of typical planning problems arising during offshore wind farm design including site selection, wind turbine location, and cabling layout. The students will know about logistics resource planning and process scheduling during offshore wind farm installation phase, and logistics planning problems for offshore wind farm operations and maintenance required on strategical and tactical levels.\nAfter completing the course, the students will also know about historical development of offshore oil and gas logistics infrastructure on the NCS, upstream part of offshore oil and gas supply chain, and offshore upstream logistics activities. The students will have knowledge of typical logistics planning problems in offshore oil and gas supply chain such as cargo and personnel transportation planning from supply bases to offshore installations by vessels and helicopters, planning of emergency response system and rescue resources positioning, on the examples of offshore operating energy companies and their planning procedures and decision support tools.\nSkills\nAfter completing the course, the students will be able to\ndiscuss and compare various CCUS technologies and value chains from the perspective of an emitter, i.e. single chain, and infrastructure designer, i.e. network perspective\nidentify a methodology for SCM and logistics decision making in CCUS context\nde\nfine the phases of offshore wind projects, the offshore wind farms logistical infrastructure and resources, the types of logistics activities and operations\nidentify\ndifferent planning level problems in\noffshore wind farm logistics\ndescribe logistics challenges in wind farm siting, wind turbine location, cabling layout, installation scheduling\nplanning, fleet planning\nfor wind farm maintenance, scheduling of maintenance tasks for offshore wind farms and routing and scheduling of maintenance fleet\ndescribe the parts of the offshore upstream oil and gas supply chain, the supply chain logistical infrastructure and resources, the types of offshore upstream logistics activities\nidentify the types of\nsupply vessel planning, helicopter personnel transportation planning and emergency response system planning problems on strategical, tactical and operational levels\nderive logistics challenges in\nsupply vessel planning and helicopter personnel transportation planning to offshore oil and gas installations on different levels, discuss planning practices and tools\nGeneral competences\nAfter completing the course, the students will be able to\nunderstand the main principles and challenges related to CCS technology application in singe supply chains and large-scale logistics networks\nidentify and discuss CCS upstream logistics problems at strategic, tactical and operational levels\nunderstand current and future advantages and disadvantages of offshore energy production\nexplain upstream logistics activities in offshore wind energy and offshore oil and gas production\nidentify types of planning problems arising in upstream offshore energy logistics networks on different levels in research and work contexts",
            "exam_format": "Form of assessment: Home exam\nProportion: 100 %\nDuration:\n2 days (from Thursday to Friday 23:59)\nGrouping: 3-4 students in group\nGrading scale: Letter (A - F)\nSupport material: Lecture materials, published research works, web-pages of companies and organizations\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:22 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Supply chain design, planning, and control; logistics activities in supply; resource planning and operations management; decision making; optimization and simulation models."
        },
        {
            "course_code": "LOG904-118",
            "name": "Computational Optimization Models for Production Planning",
            "learning_outcomes": "Knowledge\nUnderstanding of classic production planning models and the impacts of queuing.\nSkills\nAbility to create optimization versions of these models in AMPLpy\nGeneral competence\nAbility to create optimization versions of other models including your own.",
            "exam_format": "Examination\n:\nForm of assessment:\nWritten school exam\nProportion:\n100 %\nDuration:\n2 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAny printed material.\nNo electronics.\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:23 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "LOG904-124",
            "name": "Efficiency and productivity measurement using Data Envelopment Analyses",
            "learning_outcomes": "The student’s learning outcome after completing the course is in three parts as follows:\nKnowledge:\nAfter the course, students will have understood the theories, concepts, and principles underlying the importance of efficiency and productivity measurements of an organization, using DEA  as a tool for an assessment. This knowledge will put students in a position to evaluate or suggest performance evaluation of their future workplaces. For students who choose to proceed with Ph.D. studies, the knowledge gained opens an avenue for research topics within efficiency and productivity measurements with the application of DEA.\nSkills\n: The course will allow students to apply DEA as a tool for efficiency and productivity measurement.\nGeneral competence\n: After the course, those who pass the exams will have general competence in efficiency and productivity assessments using the DEA framework.",
            "exam_format": "The final exam is a written school exam lasting three hours and will be held on Friday from 09:00 to 12:00 hrs\n.\nAdditionally, as preparation for the exam, there will be exercises with submission deadlines. These are not mandatory for taking the exam.\nThe final exam will be a school exam on Friday and lasts for three hours.\nGrading scale: Letter (A - F)\nGrouping for exams and assignments: Individually\nSupport material:\nAll teaching materials are allowed\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:23 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Since all students are at the master's level or higher, there are no particular requirements. However, being able to work with numbers and, in particular, a basic understanding of statistical terms such as averages, standard deviation, and interpretation of the coefficients of regression analysis will be value-added to students."
        },
        {
            "course_code": "LOG904-125",
            "name": "Transportation Infrastructure and Economic Development",
            "learning_outcomes": "Knowledge: To have a solid grasp of how, when, why and to what extent transport infrastructure affects businesses and the economy; how and why different economy modelling methods give rise to different predictions of economy impacts\nSkills: understand how to incorporate economic impacts into a transport cost benefit analysis\nGeneral competence: understand the strengths and limitations of transport role in influencing economic performance and the relationship between welfare and GDP appraisal metrics.",
            "exam_format": "Examination 1\n:\nForm of assessment:\nHome assessment without presentation\nProportion:\n60 %\nDuration:\nSubmitted at the end of Thursday of the week long seminar\nGrouping:\nIndividually or group\nGrading scale:\nLetter (A - F)\nSupport material:\nReferences provided in the coursework guidance and lectures\nExamination 2\n:\nForm of assessment:\nHome assessment without presentation\nProportion:\n40 %\nDuration:\nSubmitted at the end of Saturday after the week long seminar\nGrouping:\nIndividually or group\nGrading scale:\nLetter (A - F)\nSupport material:\nReferences provided in the coursework guidance and lectures\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:23 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "The students will be using spreadsheets during the course and the assessment.  Basic spreadsheet skills are required."
        },
        {
            "course_code": "LOG904-126",
            "name": "Decision Modeling and Metaheuristics",
            "learning_outcomes": "To learn how to translate business situations into formal models, identify the relevant data and investigate how those models enhance decision making.\nKnowledge\n:\n\nOptimization models: linear, integer, and non-linear programming.\n\nComplex and mixed models: Multi-objective optimization\n\nAlgorithm design. Visual basic in Excel\nSkills\n:\n\nGiven an optimization problem, be able to create mathematical models first with variables, functions and constraints, and then implement the model in the spreadsheets language.\n\nIdentify the appropriate solver in Excel for an optimization problem. Analyze its outcomes.\n\nCreate an algorithm and implement it in computer code to find good solutions for an optimization problems.\n\nFind and analyze results for a given problem.\nGeneral competence\n:\n\nBecome proficient in fact-based management.\n\nBe able to analyze a real situation to identify the optimization problems involved, and to propose solutions to them based on mathematical models and algorithms.",
            "exam_format": "Form of assessment:\nOpen book exam: Solve two optimization problems with Excel.\n•\nProportion:\n50 %\n•\nDuration:\n2 hours Friday 10:00 – 12:00\n•\nGrouping:\nIndividually\n•\nGrading scale:\nLetter (A - F)\n•\nSupport material:\nHomework (project):\nForm of assessment:\nImplementation of a metaheuristic algorithm in Visual Basic for Excel (or similar computer language).\n•\nProportion:\n50%\n•\nDuration:\nDeadline: Saturday 23:00.\n•\nGrouping:\nGroup of 2 students\n•\nGrading scale:\nLetter (A - F)\n•\nSupport material:\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:23 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "\nBasic knowledge in optimization.\n\nBasic linear programming"
        },
        {
            "course_code": "LOG904-130",
            "name": "Port Logistics",
            "learning_outcomes": "Knowledge:\nObtain basic knowledge about the port sector and its challenges, and what industry and policy makers are doing to tackle these challenges.\nSkills:\nUnderstand basic economic, environmental and logistical problems and what can be done to solve them.\nGeneral competence:\nBeing able to understand basic concepts and models.",
            "exam_format": "Form of assessment:\nHW assignment\nProportion:\n100 %\nDuration:\nN/A\nGrouping:\nGroups of 2-3\nGrading scale:\nLetter (A - F)\nSupport material:\nAll material provided in class; Internet; any other source.\nHW assignment: You form your own groups. Each group will be assigned a port case study and will be asked to (a) produce a report on the case study, and (b) presenting the report in class by a PPT, 20 minutes max. per group. Each case study refers to a specific port. You will be asked to investigate and report back on the port in question in a document no more than 15 pages+1 cover page.\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:23 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "An elementary knowledge of the maritime sector is desirable"
        },
        {
            "course_code": "LOG904-131",
            "name": "Applied Dynamic and Stochastic Programming for Logistics",
            "learning_outcomes": "Knowledge:\nDuring the course, students will learn and understand fundamental ideas about separability, dynamic programming and stochastic programming approaches suitable for real-world applications of logistics.\nSkills:\nAfter the course, students will be able to build applicable stochastic programming models (like wait-and-see, here-and-now, scenario based two-stage linear), utilize separability ideas for optimal decision making, and apply algorithmic principles of dynamic programming (by graphs, tables and formulas) in production, transport, supply chain management and logistics in general.\nGeneral competence:\nStudents will improve their general skills for model building in logistics and they will learn how to make their knowledge about theoretical concepts useful in practice. They will improve in addressing best questions to the users when they develop quantitative models in logistics. They will get the feedback about their ability to work in the team under pressure of deadlines and challenges that are typical for those who collaborate with industry on real world problems.",
            "exam_format": "Form of assessment:\nHome assessment\nis\nbased on 4 assignments (1 each day and deadline on Friday at 11 a.m.)\nwith\noral\npresentation\n(on Friday at 1 p.m.).\nAll 5 parts are eqully marked.\nProportion:\n100 %\nDuration:\n4 assignments are given to students every day till 2 p.m. (on Monday, Tuesday, Wednesday, Thursday), deadline for all submissions is on Friday 11 a.m. and  oral presentation of achieved results is on Friday at 1 p.m. till 3 p.m.\nGrouping:\ngroup work\nGrading scale:\nLetter (A - F)\nSupport material:\nStudents will get references (e.g. to books available in MUC library) and main supporting readings at the beginning of the course and optional potentionally helpful resources will be delivered during the course (together with specification of assignments).",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Basic Calculus knowledge (by 1st year of bachelor study)"
        },
        {
            "course_code": "LOG904-140",
            "name": "Service Industry Logistics",
            "learning_outcomes": "Knowledge\n: Students will gain knowledge of operations management in the context of companies in the service industry, specifically in the context of their supply chain and service processes (mapping, strategies, critical points, service design)\nSkills\n: Critical thinking; oral communication skills; teamwork skills\nGeneral competence\n: Be able to analyse a real case under the scope of service operations management",
            "exam_format": "Form of assessment:\nGroup assignment (report)\nProportion:\n60 %\nDuration:\nDue date on Thursday at 23:59\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupport material:\nmaterials from class\nForm of assessment:\nGroup presentation and discussion of the report,\nwith individual assessment\nProportion:\n40%\nDuration:\n30 minutes (per group) – Friday morning, starting at 9:15.\nGrouping:\nIndividually\nGrading scale:\nLetter (A - F)\nSupport material:\nmaterials from class",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "LOG904-151",
            "name": "Disaster Relief Operations and Supply Chain",
            "learning_outcomes": "We will take a broad case-based approach to the operations of disaster relief organisations exploring the background to the sector’s work and how this has changed over recent decades, including typologies and definitions of disasters, principles of humanitarianism, challenges and risk sources. You will apply the principles of operations and supply chain management, including resource-based challenges and the emerging capabilities theory, to explore fast changing and uncertain environments. You will apply the learning through written and verbal forms of communication with an industry practitioner and asynchronous assessment.",
            "exam_format": "Form of assessment:\nHome assessment. Group panel discussion which pre-recorded and uploaded to Inspera\nProportion:\n50%\nDuration:\n7 minutes\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupport material:\nPowerPoint, Prezi, or Google Slides. Details to be shared on Day One. Deadline Saturday 23.59.\nForm of assessment:\nHome assessment. Individual report\nProportion:\n50%\nDuration:\n1,000 words\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nMS Word submitted via Inspera. Details to be shared on Day One. Deadline Saturday 23.59",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "No previous knowledge of humanitarianism or disaster relief is required for this seminar."
        },
        {
            "course_code": "LOG904-161",
            "name": "Digital Service Design",
            "learning_outcomes": "Knowledge: In-depth knowledge and practical understanding of methods and approaches relevant to digital design and innovation and how to select and justify their use.\nSkills: The ability to critically interpret and creatively respond to a range of design briefs and meet clients’ expectations.\nGeneral competence: The ability to create integrated and logical digital design solutions that balance the needs of the consumer, with organization goals and technical feasibility.",
            "exam_format": "Form of assessment:\nHome assessment with the presentation\nProportion:\n100 %\nDuration:\ndeadline for the written report submission on Saturday at 23:59\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupport material:\nN/A\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:24 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Technical disciplines."
        },
        {
            "course_code": "LOG904-162",
            "name": "Applications of Scheduling and Timetabling",
            "learning_outcomes": "Not specified",
            "exam_format": "Form of assessment:\nhome assessment with presentation -\nshort mp4 interactive video\nProportion:\n50 %\nDuration:\n5 to 8 minutes (video duration), to be delivered on Day 4 and presented online on Day 5.\nGrouping:\ngroups of two students\nGrading scale:\nLetter (A - F)\nSupport material:\ncourse materials, research material, interviews with lecturer\nForm of assessment:\nhome assessment without presentation - written review or summary of a selected application article\nProportion:\n50 %\nDuration:\ntext with 6 to 8 pages using\nthe template of any good journal in the area of Operations Research\n(pdf file), to be delivered on Day 5+1.\nGrouping:\ngroups of two students\nGrading scale:\nLetter (A - F)\nSupport material:\ncourse materials, research material, interviews with lecturer\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:24 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Linear and Integer Programming, basics of Metaheuristics"
        },
        {
            "course_code": "LOG904-167",
            "name": "Blockchain in Supply chain",
            "learning_outcomes": "Not specified",
            "exam_format": "Form of assessment: Final Exam - Conceptual quiz in Canvas\nProportion: 50 %\nDuration: -\nGrouping: Individual\nGrading scale: Letter (A - F)\nSupport material: n/a\nForm of assessment: Research Paper - Submission to Inspera\nProportion: 50%\nDuration: The paper is due by Saturday 8.00pm\nGrouping: Group\nGrading scale: Letter (A - F)\nSupport material: n/a",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Basic understanding of supply chain, Basic computational skills and comfortable with simple applications on computers and mobile devices."
        },
        {
            "course_code": "LOG904-169",
            "name": "Business to Business Relationship Marketing",
            "learning_outcomes": "Knowledge:\nGain a solid understanding of the fundamentals of Business to Business marketing strategy formulation and business relationships.Demonstrate and explain how marketing to businesses differs from marketing to consumers and how this impacts design and execution of marketing strategies for companies in this sector.\nSkills:\nDevelop presentation skills and oral delivery; analytical skills; team building skills; Use the marketing tools to help evaluate and design a sustainable Value proposition and effective B2B marketing strategy\nGeneral competence:\nAppreciate how marketers can deliver sustainable competitive advantage in this environment through assessing market opportunities, examining the business environment, and managing the functional aspects of marketing in an organisational setting.",
            "exam_format": "Form of assessment:\nWritten home exam\nProportion:\n50 %\nDuration:\n2 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nn/a\nForm of assessment:\nPresentation\nProportion:\n50%\nDuration:\n30-40minutes\nGrouping:\ngroup\nGrading scale:\nLetter (A - F)\nSupport material:\nn/a\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:24 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "LOG904-176",
            "name": "Incoterms, Cargo Insurance and Transport Law",
            "learning_outcomes": "Knowledge:\nThe students will have a profound knowledge of Incoterms®, International Transport law based on the transport conventions and International Cargo Insurance.\nSkills\n:\nCognitive\n: The students’ cognitive skills will enable them to understand and process complex cases within the logistic environment.\nPractical\n: The students’ practical skills will enable them to work with and solve logistical challenges both from the sellers, buyers, forwarders and Cargo Insurers perspective.\nCreative and communicative skills\n: The students should be able to communicate\nfor a variety of purposes and audiences\nin the subject area, and to be able to be creative based on the obtained knowledge.\nGeneral competence:\nThe students’ obtained and achieved knowledge should enable them to apply knowledge and skills independently in different situations through ability to work together, responsibility, ability to reflect and critical thinking in studies and profession",
            "exam_format": "Examination\n:\nForm of assessment:\nHome assessment without presentation\nProportion:\n100 %\nGrouping:\nGroups (1 to 4 in each group)\nGrading scale:\nLetter (A - F)\nSyllabus:\nTo be announced before the seminar starts\n.\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:24 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Supply chain management course is advisable but not mandatory"
        },
        {
            "course_code": "LOG904-181",
            "name": "Data-Based Decision - Data science course in Python",
            "learning_outcomes": "Knowledge: Students will gain knowledge of data analytics and data visualization towards decision support.\nSkills: Use of Python for data analytics and PowerBI for data visualization\nGeneral competence: Ability to prepare data for decision support",
            "exam_format": "Form of assessment: Individually assignment in Inspera, deadline on Saturday.\nProportion: 100 %\nGrouping: Individually\nPresentation during the seminar week\nFinal grade based on 1 PDF report loaded in Inspera and presentation\nGrading scale: Letter (A - F)",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "No specific background needed. We will start from zero."
        },
        {
            "course_code": "LOG904-182",
            "name": "Digital Technologies for a Sustainable Circular Economy",
            "learning_outcomes": "Upon fulfillment of this course, the students should achieve the following learning outcomes:\nKnowledge:\nA deep understanding of the digital technologies that can enable the implementation of circular economy principles and their importance for sustainable development.\nA general understanding of the different applications of digital technologies for circular economy in various manufacturing contexts and supply chains.\nBasic notion of the evaluation of sustainability impacts of circular economy enabled by digital technologies.\nSkills:\nApply digital technologies to implement circular economy principles in various manufacturing and logistics contexts.\nDesign and communicate sustainable and circular business models enabled by digital technologies.\nAnalyze and evaluate the potential impact of digital technologies on circular economy practices.\nGeneral competence:\nIndependence and responsibility in applying knowledge and skills acquired during the course to real-life situations.\nAbility to work collaboratively and effectively in teams to identify and solve complex problems related to digital technologies, sustainability, and circular economy.\nCapacity for self-reflection and critical thinking in the field of sustainable circular economy and digital technologies.\nAwareness of environmental and social implications of digital technologies for a sustainable circular economy.",
            "exam_format": "Form of assessment:\nHome Exam and Group work presentation\nProportion:\n100 %\nDuration:\n5 days (students are given the exam on Monday after class)\nGrouping:\nGrouping of 2-3 students\nGrading scale:\nLetter (A - F)\nSupport material:\narticles on the role of digitalization for sustainability and circular economy distributed by the teacher and supplemented by lecture notes.\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:24 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Prior knowledge on Circular Economy for Business and Supply Chain is suggested although non strictly required: the course will start with a brief recap of these concepts.\nLOG904-158 A Circular Economy for Business and Supply Chains (Autumn 2023)"
        },
        {
            "course_code": "LOG904-183",
            "name": "Energy Transitions",
            "learning_outcomes": "Knowledge:\nAfter completing the course, the students will know global energy landscape, energy systems and energy transitions scenarios; factors, tools, and trends in a low-carbon energy transition environment.\nSkills:\nAfter completing the course, the students will be able to\nEvaluate the role of energy in the global economy and understand the factors driving energy transitions.\nApply to real-world cases knowledge of energy systems and energy transitions, and critically review them.\nGeneral competence:\nAfter completing the course, the students will be able to\nDemonstrate a critical and interdisciplinary approach to studying energy transitions and their impact on society and the environment.\nCommunicate effectively and persuasively about energy transitions, including the political, economic, and technical dimensions of energy systems, and their logistical challenges.",
            "exam_format": "Form of assessment:\nHome exam without presentation\nProportion:\n100 %\nDuration:\n4.5 days (published on Tuesday 15:00, submission deadline Saturday 23:59)\nGrouping:\nIndividual only, discussion in groups is welcome\nGrading scale:\nLetter (A - F)\nSupport material:\nRecommended course literature (books, peer-reviewed articles and internet sources)\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:24 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "No special requirements. Acquaintance with energy systems, logistics planning in the energy industry might be a benefit."
        },
        {
            "course_code": "LOG904-184",
            "name": "Cross-border Logistics",
            "learning_outcomes": "Knowledge: Become familiar with cross-border trade and transport environment; Understand the interdependences between regulation and the operational environment within the context of cross-border trade; Gain awareness of common cross-border trade and transport compliance requirements; Be aware of how relevant regulations and procedures in cross-border trade are shaped and can be influenced.\nSkills: Critically analyse the interplay between regulation, technology, trade & customs procedures, policy making, border management, and supply chain management and logistics practice; Become familiar with standard online research tools and business compliance requirements within cross-border logistics operations or their control.\nGeneral competence: To prepare and discuss solutions to complex challenges using various media including written and verbal forms of communication through classroom interaction, exercises, and dialogue with the seminar leader ­- a leading regarded expert in the field.",
            "exam_format": "Form of assessment:\nHome assessment with focus on a cross-border logistics related compliance or control challenge; consisting of a group panel discussion which is pre-recorded and uploaded to Inspera.\nProportion:\n50%\nDuration:\n7 minutes\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupport material:\nDetails to be shared on Day One. Deadline for uploading the video recoding is Friday 23:59.\nForm of assessment:\nIndividual short essay\nProportion:\n50%\nDuration:\n800 words\nGrouping:\nIndividually\nGrading scale:\nLetter (A - F)\nSupport material:\nMS Word submitted via Inspera. Details to be shared on Day One. Deadline Saturday 23:59",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "No previous knowledge of cross-border logistics operations is required for this seminar, however some knowledge of the underpinning theories of operations, supply chain or logistics management is assumed."
        },
        {
            "course_code": "LOG904-185",
            "name": "Sustainable mobility, policy planning and behavior change",
            "learning_outcomes": "The course provides the student with a hands-on knowledge of Stated Preference Methods using a learn-by-doing approach. The techniques used will allow the student to gain insights into economic theory and be able to plan and implement autonomously a basic stated preference survey study with the intent of analyzing agents’ preferences so to promote sustainability in transport thanks to policy planning capable of stimulating behavior change.\nKnowledge: The student will familiarize with a dedicated software that become familiar with basic microeconomic concepts and learn how to plan intervention policies capable of stimulating the much-needed behavior change so to promote sustainability in transport.\nSkills: The student will acquire all the required skills needed to apply basic microeconomic concepts to develop planning capabilities linked to the promotion of sustainable policies for transport. The skills acquired will be cognitive (i.e., policy plan development), practical (i.e., questionnaire administration), creative (i.e., alternative plan definition and testing) as well as communicative skills (i.e., presenting the results obtained in class).\nGeneral competence: The general competences the student will gain are linked to the application of the knowledge and skills to different planning contexts also favored by experiencing and strengthening individual and group work capabilities supported by work sharing tasks and the development of a sense of responsibility stimulated by working under pressure and within a tight scheduling of group activities. All these elements put together will be enhanced and supported by the constant stimulus to think critically under cognitively demanding conditions so to realistically simulate working conditions that will be encountered when starting a profession. In particular, the student, at the end of the course, will be competent in planning, defining, piloting, fine-tuning, and administering a questionnaire capable of acquiring the necessary data to develop a well-grounded policy planning strategy capable of promoting sustainability in transport.",
            "exam_format": "Form of assessment:\nHome assessment with presentation\nProportion:\n100 %\nDuration:\n4 hours\nGrouping:\nIndividually or group\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written material",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "This course focuses on how to promote sustainable mobility via policy planning so to stimulate behavior change.\nThe course provides both theoretical and practical guidance on how to study and promote sustainability in both passenger and freight transport.\nThe course using stated preference techniques illustrates how they can be applied in practice in prioritizing solutions thanks to policy co-creation and stakeholder engagement.\nExamples and exercises make up a central part of the course. Course participants are presented with case studies originating from applications in transportation economics. You will learn how to use a dedicated software that is used in European research projects.\nLecture notes and exercises instructions are delivered in class."
        },
        {
            "course_code": "LOG904-186",
            "name": "Purchasing Management in the Public Sector",
            "learning_outcomes": "Knowledge:\nKnow about models for implementing strategic goals through purchasing policies\nUnderstand the limitations and regulations placed on public purchasing and why these regulations have been placed\nUnderstand how different purchasing methods affect the buying markets\nUnderstand how to develop a purchasing organization that confirms with your strategic goals\nKnow how to assess what purchasing competence is needed in your organization\nSkills:\nBe able to develop suitable purchasing policies for your organization\nBe able to assess longer-term effects of your purchasing policies\nBe able to develop the competence needed in your organization\nGeneral competence:\nLearn to handle case\nDevelop ability to cooperate with other students in gathering and organizing information",
            "exam_format": "Form of assessment:\nWritten exam\nProportion:\n40 %\nDuration:\n2 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nNone\nForm of assessment:\nWritten case exam\nProportion:\n60%\nDuration:\n3 hours\nGrouping:\nGroups of 3 or 4 determined by lecturer\nGrading scale:\nLetter (A - F)\nSupport material:\nAll written material in the course\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:25 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Some knowledge of purchasing processes and strategic management is recommended, but supportive readings will be suggested for those who do not have such knowledge."
        },
        {
            "course_code": "LOG904-187",
            "name": "Strategies for Successful Procurement in Projects",
            "learning_outcomes": "Knowledge:\nThe students should understand theories of interorganizational exchange, and the basic knowledge of strategies and principles for efficient project procurements.\nSkills:\nThe students should have the skills to apply the knowledge into practical projects as assistant project procurement managers.\nGeneral competence:\nThe students should be able to apply communicate strategies within an organization, and to analyse the projects framework conditions, and sketch out a plan for the contracting process.",
            "exam_format": "•\nForm of assessment\n: Home assessment with oral presentation.\n•\nProportion\n: Oral presentation is\nevaluated as to a 20% weight; and the written exam is 80 % weight of the total \tcharacter.\n•\nDuration\n: Oral presentation to be held\nsame day\nbefore submission deadline, duration 15 minutes. Maximum length written assignment 10 pages.\n•\nGrouping\n: group of\nmaximum three persons\n•\nGrading scale\n: Letter (A - F)\n•\nExamination Support Material:\nRelevant curriculum literature.\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:25 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "The students should have knowledge of procurement processes, understand construction contracts, and be familiar with the core basics of project management."
        },
        {
            "course_code": "LOG904-190",
            "name": "Mixed Integer Programming Models for Logistics Optimization",
            "learning_outcomes": "The student’s learning outcomes after completing the course:\nKnowledge:\nUnderstand the principles and scope of MIP/IP methods in logistics optimization.\nRecognize common logistics optimization problems and their mathematical structures.\nGain insight into modelling practical logistics processes.\nSkills:\nFormulate real-world operations and logistics problems as MIP/IP models.\nImplement and solve optimization models using a programming language and an optimization solver.\nAnalyze and interpret computational results to support logistics decision-making.\nGeneral competence:\nApply MIP/IP modelling techniques effectively to logistics and operations problems.\nCommunicate modelling choices and optimization results clearly.\nReflect on the practical use and limitations of optimization in logistics contexts.",
            "exam_format": "Examination\n:\nForm of assessment:\nFormulate classical problems as MIP/IP models, implement them using a programming language and a MIP solver, solve them, and submit the implementations.\nProportion:\n30 %\nDuration:\nsubmission at the end of Day 2.\nGrouping:\nGroups of two students.\nGrading scale:\nLetter (A - F)\nSupport material:\nAll materials permitted, including programming libraries, textbooks, notes, and online resources.\nForm of assessment:\nSelect or be assigned a practical logistics problem, formulate it as a MIP/IP model, implement it using a programming language and a MIP solver, solve it, and submit the implementations and a concise written report detailing their modelling process and results.\nProportion:\n70 %\nDuration:\nsubmission at the end of Day 6.\nGrouping:\nGroups of two students.\nGrading scale:\nLetter (A - F)\nSupport material:\nAll materials permitted, including programming libraries, textbooks, notes, and online resources.\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:25 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Basic mathematical knowledge, especially algebra and logical reasoning.\nIntroductory programming experience (e.g., using loops, functions) in any language.\nFamiliarity with linear programming is advantageous but not essencial.\nFamiliarity with basic logistics and operations concepts is advantageous but not essential."
        },
        {
            "course_code": "LOG904-192",
            "name": "Public Transport Planning and Operations",
            "learning_outcomes": "Knowledge: know how the public transport system affects the rest of society.  To understand the key principles of public transport planning. To have a knowledge of the factors that affect the costs of operating local and regional public transport systems.\nSkills: to be able to use analytical tools in the assessment of specific public transport systems; and to be able to use analytical tools when planning the operation of public transport systems.\nGeneral competences: students’ participation in the course will develop their independent thinking, problem-solving and team working.",
            "exam_format": "Form of assessment: Group project- presentation and report about optimisation of bus line in Molde\nProportion: presentation 50 %, report 50%\nDuration: Presentation on the Friday of the week long seminar, report submitted on the same Friday after the presentation.\nGrouping: Group (but including individual assessment by lecturer in Presentation)\nGrading scale: Letter (A - F)\nSupport material: References provided in the coursework guidance and lectures\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:25 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Creativity and flexibility."
        },
        {
            "course_code": "LOG904-193",
            "name": "Planning of Renewable Energy Value Chain",
            "learning_outcomes": "Knowledge:\nUpon completing the course, students will understand the developments and trends in ocean and floating solar energy, including current advantages and disadvantages, examples of active projects, components and structures, key characteristics, logistical challenges, and the resources utilized for ocean and floating solar energy.\nAdditionally, students will be informed about projects, developments, and trends in clean energy carriers, their supply chains, and the associated logistical challenges and requirements.\nSkills:\nAfter finishing the course, students will be able to:\n- Evaluate the potential applications of ocean and floating solar energy in various contexts.\n- Assess the role of energy carriers by considering their advantages and disadvantages related to costs, emissions, safety, and logistics.\n- Apply knowledge of ocean energy systems and carriers to real-world cases and conduct critical reviews.\n- Identify types of logistics planning problems related to energy systems.\n- Interpret models that can be utilized to plan the supply chain of energy carriers.\nGeneral competence:\nUpon completion of the course, students will be able to:\n- Demonstrate a critical and interdisciplinary approach to studying ocean energy and its societal and environmental impacts.\n- Exhibit a critical and interdisciplinary perspective on energy carriers and their societal and environmental consequences.\n- Communicate effectively and persuasively about emerging energy sources, covering the political, economic, and technical dimensions of energy systems and their logistical challenges.\n- Understand supply chain planning for energy carriers.",
            "exam_format": "Form of assessment:\nHome exam without presentation\nProportion:\n100 %\nDuration:\n3.5 days (published on Tuesday 15:00, submission deadline Friday 23:59)\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nRecommended course literature (books, peer-reviewed articles and internet sources)\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:26 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Energy\nsystems\n, logistics planning in energy industry, logistics activities in supply, resource planning and management, decision making, optimization."
        },
        {
            "course_code": "LOG950",
            "name": "Master's Degree Thesis",
            "learning_outcomes": "Knowledge\nHow to define a problem and determine a research question\nHow to structure and organize a research project\nUnderstand the role of theory in research\nHave updated theoretical knowledge within the research field of the master thesis\nSkills\nAbility to perform an independent research task with a strong professional and methodological basis\nHow to choose an appropriate method for collecting relevant information and data\nBe able to use theory to analyse key issues within the topic of the master thesis\nHow to write an academic report\nGeneral competence\nHow to plan and accomplish a scientific work",
            "exam_format": "Form of assessment:\nMaster thesis with oral examination\nProportion:\n100%\nDuration:\n1 semester\nGrouping:\n-\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:38 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Only students enrolled in the MSc program in Logistics can write a thesis under the LOG950 course code. In addition, each candidate must have written a proposal which is approved under the code LOG904-100. LOG950 should be the last course taken within the MSc program. This means that the candidate should have approved 90 ECTS in order to have the master thesis graded."
        },
        {
            "course_code": "LOG953",
            "name": "Master's Degree Thesis",
            "learning_outcomes": "Knowledge\nHow to define a problem and determine a research question\nHow to structure and organize a research project\nUnderstand the role of theory in research\nHave updated theoretical knowledge within the research field of the master thesis\nSkills\nAbility to perform an independent research task with a strong professional and methodological basis\nHow to choose an appropriate method for collecting relevant information and data\nBe able to use theory to analyse key issues within the topic of the master thesis\nHow to write an academic report\nGeneral competence\nHow to plan and accomplish a scientific work",
            "exam_format": "Form of assessment:\nMaster thesis with oral examination\nProportion:\n100%\nDuration:\n1 semester\nGrouping:\n-\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:38 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Only students enrolled in the MSc program in Sustainable Energy Logistics can write a thesis under the LOG953 course code. In addition, each candidate must have written a proposal which is approved under the code LOG904-100. LOG953 should be the last course taken within the MSc program. This means that the candidate should have approved 90 ECTS in order to have the master thesis graded."
        },
        {
            "course_code": "null",
            "name": "null",
            "learning_outcomes": "Not specified",
            "exam_format": "Not specified",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "SAF230",
            "name": "International Politics",
            "learning_outcomes": "Upon completion of the course students are expected to have acquired the following knowledge:\nUnderstanding the key concepts, theories, and approaches used in the study of international politics\nUnderstanding the key issues and challenges facing the global community\nUpon completion of the course students are expected to have acquired the following skills:\nAnalyzing the causes and consequences of the global problems and social issues\nDeveloping critical thinking and analytical skills for evaluating the complex and dynamic nature of international politics.\nUpon completion of the course students are expected to have acquired the following competence:\nIdentifying and discussing the attempts to handle these issues and problems in world politics\nDeveloping the ability to engage in informed and critical debate on key issues in international politics.",
            "exam_format": "Form of assessment:Digital school assessment-Inspera\nDuration: 4 hours\nGrouping: Individual\nGrading scale: Letter (A - F)\nLanguage: Optional language English or Norwegian\nSupport material: Only general dictionary in mother tongue/Norwegian/English in paper version.",
            "mandatory_assignments": "Form of assessment: Presentation\nLanguage: English\nComment: Students will make a short presentation (10 minutes). The assignment must be passed in order to get access to the school exam.",
            "recommended_requirements": "None"
        },
        {
            "course_code": "SCM120",
            "name": "Principles in Value Chain Management",
            "learning_outcomes": "Knowledge:\nAfter passing the course, the student will have knowledge about:\nthe activities that make up value chains and their role in business\nsupply chain management and its role in value creation\nactivities within supply chain management\nimpact of supply chains on social and environmental sustainability\nSkills:\nAfter passing the course, the student should be able to:\nidentify primary and support activities in a value chain\nmap a company's supply chain\ncreate value through effective value chain management\nGeneral competence:\nAfter passing the course, the student should have the following competencies:\nability to identify relationships between phenomena\nability to write a professional report\nability to work in a team",
            "exam_format": "The exam\nForm of assessment: Home exam\nProportion: 50%\nDuration: 1 semester\nGrouping: Group/Individual\nGrade scale: Letter grade (A - F)\nAids: -\nForm of assessment: Home exam\nProportion: 50%\nDuration: 4 hours\nGrouping: Individual\nGrade scale: Letter grade (A - F)\nAids: -",
            "mandatory_assignments": "Compulsory work requirement: Assignment\nNumber of work requirements: 3\nRequired work requirements: 3",
            "recommended_requirements": "None"
        },
        {
            "course_code": "SCM305",
            "name": "Applied Decision Analysis",
            "learning_outcomes": "Knowledge\nUpon completing this course, the candidate:• will have broad knowledge of logistical problems and complexity of real-life logistical challenges.• will have broad knowledge of methods relevant to describing real-life business processes, decision-making, and addressing uncertainty. will be familiar with a variery of aspects of decision-making problems.• will be familiar with research and development trends in logisitcs and supply chain management.\nSkills\nUpon completing this course, the candidate:• will be able to solve real-life problems in the area of logistics with applications such as network design, scheduling, workforce organization, etc. will be able to apply spreadsheet modeling as well as relevant methods and tools for decision support.• will be able to come up with comprehensive and meaningful suggestions on resolving practical challenges in the given problem areas.• will be able to communicate the solution proposal and the results of the problem-solving.\nGeneral competence\nUpon completing this course, the candidate:• has insight into the complex decision-making aspects in the context of logistics.• can plan and execute activites supporting decision analysis and decision-making for the given problem context.• can communicate academic matters such as the choice of theories and methods through any relevant form of communication.",
            "exam_format": "Form of assessment:\nPortfolio assessment\nProportion:\n100%\nDuration:\n1 semester\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material",
            "mandatory_assignments": "Coursework requirements - conditions for taking the exam\nMandatory coursework: Assignments\nCourseworks given: Three\nCourseworks required: Two out of three\nPresence: Not required",
            "recommended_requirements": "Not specified"
        },
        {
            "course_code": "SCM500",
            "name": "International Transportation and Distribution",
            "learning_outcomes": "Knowledge\nUnderstand the main forces for international trade\nKnow the features of international trading patterns and the transport modes associated with these patterns\nKnow the standard conditions in trading contracts and how these affect the distribution of responsibilities in international transports\nKnow the basic environmental effects of different transport modes\nSkills\nBe able to apply the theory of trade to explain the global pattern of trade\nBe able to set up a comparative environmental analysis of means of transport\nSearch for and find relevant academic literature related to a problem of your own\nGeneral competence\nAcademic writing, including the formulation of a problem statement\nAbility to critical thinking",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n60%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material\nForm of assessment:\nHome assessment\nProportion:\n40%\nDuration:\n8 weeks\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:26 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "The students should have passed introductory courses in business and economics. Some knowledge of basic logistics is an advantage"
        },
        {
            "course_code": "SCM702",
            "name": "Purchasing and Supply Theory",
            "learning_outcomes": "Knowledge\nAfter completing this course, a student who fully engaged with the course activities shall be knowledgeable about:\nthe role of purchasing and supply management in creating and maintaining competitive advantage\nhow to promote social, environmental, and economic sustainability performance through purchasing and supply management function\nthe main activities performed in a typical industrial purchasing process\nthe challenges associated with industrial purchasing and supply management\nthe effective tactics for addressing challenges in industrial purchasing and supply management\nSkills\nAfter completing this course, a student who fully engaged with the course activities shall be able to:\nidentify and explain theories and models relevant for different situations encountered in purchasing and supply management\napply relevant theories and models to analyze issues encountered in purchasing and supply management\ncompare alternative approaches to solving problems encountered in purchasing and supply management\nselect the most suitable solutions for addressing issues encountered in purchasing and supply management\nGeneral competence\nAfter completing this course, a student who fully engaged with the course activities shall develop the following general competencies:\nability to work in a team\nability to engage in a dialogue\nability to reflect on a task and create an action plan\nability to make informed business decisions",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n70%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nCalculator that may contain data + general dictionary in mother tongue/Norwegian/English in paper version\nForm of assessment:\nHome assessment\nProportion:\n30%\nDuration:\n8 weeks\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupport material:\nCalculator that may contain data + general dictionary in mother tongue/Norwegian/English in paper version",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Same as acceptance to the MSc program in logistics"
        },
        {
            "course_code": "SCM703",
            "name": "Applied Supply Chain Management",
            "learning_outcomes": "Knowledge\nThe successful candidate should by the end of the course:\nKnow the differences between different types of demand in SCM\nKnow how to use different demand scenarios in practice\nKnow basic methods of inventory management\nKnow how to calculate, compare and explain logistics performance index (LPI)\nSkills\nThe successful candidate should by the end of the course:\nBe able to execute demand forecasting in SC\nBe able to execute the methods of inventory management in SC\nBe able to use commercial optimization software tools like LINGO for solving optimization problems in logistics\nGeneral competence\nThe successful candidate should by the end of the course:\nBe familiar with methods and techniques used for modeling and solving logistic problems that occur in practice\nBe aware of the potential value of integrating decision making, rather than making decisions sequentially",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n100%\nDuration:\n3 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nFormula overview sheet, calculator, computer if the exam is held in Inspera, g\neneral dictionary in mother tongue/Norwegian/English in paper version",
            "mandatory_assignments": "Coursework required:\nOral presentation of the LPI Project\nAttendance:\nNot required",
            "recommended_requirements": "Equivalent to requirements for the MSc programme in Logistics."
        },
        {
            "course_code": "SCM705",
            "name": "Cost Management in SCM",
            "learning_outcomes": "Knowledge\nThe successful candidate should by the end of the course:\nKnow the essence of costs in SCM\nKnow how to use identify the costs in SC\nKnow how to use the cost information in SCM\nSkills\nThe successful candidate should by the end of the course:\nBe able to recognize the costs in SC\nBe able to estimate the costs in SC\nBe able to execute the cost-related methods in the decision-making process in SC\nGeneral competence\nThe successful candidate should by the end of the course:\nBe familiar with the methods and techniques used for identification and estimation of costs in practice of SCM\nBe aware of the potential value-added processes determining the supply chain performance",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n100%\nDuration:\n3 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nFormula overview sheet, calculator, computer if the exam is held in Inspera, g\neneral dictionary in mother tongue/Norwegian/English in paper version\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:38 PM",
            "mandatory_assignments": "Coursework given:\n3\n(for individual practice and discussion)\nCoursework required:\n0\nAttendance:\nNot required",
            "recommended_requirements": "Same as the requirements for the MSc Logistics program."
        },
        {
            "course_code": "SPR315",
            "name": "Norwegian I Language and Culture",
            "learning_outcomes": "Students should be able to understand everyday conversations and be able to communicate orally and in writing, so that they can read simple Norwegian text. Emphasis will be placed on intercultural training where students will receive an introduction to Norwegian society, particularly the local and county business settings, geography and nature, political system, health and welfare policies and social and cultural conditions.",
            "exam_format": "Form of assessment:\nWritten school assessment\nProportion:\n100%\nDuration:\n4 Hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\n-",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "None. The target group for this course is foreign students with some knowledge of English."
        },
        {
            "course_code": "SØK700",
            "name": "Global Economic Development",
            "learning_outcomes": "The student shall after completing the course have this total learning outcome:\nKnowledge\nHave advanced knowledge about theories for economic development processes at the societal level, locally and globally\nBe able to apply knowledge about economic development in analysis\nSkills\nCan analyze growth- and tranformation processes at the macro level\nCan carry out an independent, limited research project under supervision complying with established research ethical norms\nGeneral competence\nCan apply this knowledge when participating in public debate\nCan communicate comprehensive independent work on social economic development\nCan communicate about academic issues related to global development trends",
            "exam_format": "Form of assessment:\nHome assessment\nProportion:\n33%\nDuration:\nTo be announced\nGrouping:\nIndivdual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material\nForm of assessment:\nSchool assessment\nProportion:\n67%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material",
            "mandatory_assignments": "Mandatory coursework:\nIngen",
            "recommended_requirements": "BSc in Economics and Business Administration or equivalent"
        },
        {
            "course_code": "SØK705",
            "name": "Research methods and proposal",
            "learning_outcomes": "Knowledge:\nUnderstand methodological and related issues in philosophy of science in general and in economic/business research in particular\nSkills:\nThe ability to apply knowledge in conducting economic research and present it both orally and in writing.​\nGeneral competence:\nAbility to use knowledge and skills in an independent manner in finding academic studies that relate to the topic of a Master's thesis (and not only), as well as demonstrating a capacity for reflection and critical thinking towards these studies that are needed during the writing of a Master's thesis.",
            "exam_format": "Form of assessment:\nHome assessment\nProportion:\n100%\nDuration:\nsemester\nGrouping:\nGroup\nGrading scale:\nPass/fail\nSupport material:\nAll printed and written supporting material\nThe usage of generative AI (e.g. Chat GPT and alike) is strictly forbidden.\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:51 PM",
            "mandatory_assignments": "Mandatory coursework:\nOral presentation\nCourseworks given:\n1\nCourseworks required:\n1\nPresence:\nRequired\nComment:",
            "recommended_requirements": "Completed 1st year, Master of Business Administration"
        },
        {
            "course_code": "SØK725",
            "name": "Behavioral Economics",
            "learning_outcomes": "For decades, the standard model of behavior in economics has considered an agent as a perfectly rational, self‐interested utility maximizer with unlimited cognitive resources. This approach of modeling individual behavior has proved quite convenient, producing clear and testable predictions. However, over the past 30 years, psychologists, behavioral and experimental economists have documented behavior that is inconsistent with this standard model in ways that are important for economic outcomes. Understanding these behaviors, and their implications, is one of the most exciting areas of current economic inquiry. The aim of this course is to provide a grounding in the main areas of study within behavioral economics, including temptation and self‐control, fairness and reciprocity, reference dependence, bounded rationality and choice under risk and uncertainty. We will be using the book A course in Behavioral Economics by Erik Angner, but several lectures will also be based on published papers in the field. The lectures will cover the following topics:\nIntroduction to Behavioral Economics\nRational Choice under Certainty\nBehavioral Economics Methods\nDecision Making Under Certainty\nChoice Under Risk and Uncertainty\nIntertemporal Choice\nTopics in Behavioral Economics\nBehavioral Policy\nKnowledge\nAfter completion of the course, the student should be able to:\nidentify and discuss important contributions to behavioral economics,\nunderstand the relevance of these contributions for analysis of economic behavior,\nin particular, understand under what conditions and in what ways these contributions may substantially alter predictions and/or policy recommendations based on previous economic models.\nSkills\nIt is expected that the student will:\nbe able to critically assess the importance of these contributions for the understanding of economic behavior, in particular, be able to discuss the following problem: How descriptively accurate assumptions about human behavior do we need for economic analysis?\nbe able to use formal modelling approaches introduced in the course to solve simple, illustrative problems,\nbe able to apply the ideas and intuitive arguments discussed in the course in their own applied economic analyses, such as analysis of specific policies not explicitly discussed in the course.\nCompetence\nFurthermore, the student should:\nbe able to read and understand project reports and journal articles that make use of the concepts and methods that are introduced in the course,\nbe able to make use of the course content in their own academic work, for example in analyses that are part of their master’s thesis.",
            "exam_format": "Form of assessment:\nDigital school assessment - Inspera\nProportion:\n100%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\n-",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCourseworks given:\n1\nCourseworks required:\n1\nPresence:\nNot required\nComment:\nMandatory coursework:\nOral presentation\nCourseworks given:\n1\nCourseworks required:\n1\nPresence:\nNot required\nComment:",
            "recommended_requirements": "No specialized knowledge is required, but a background in intermediate microeconomics and macroeconomics is ideal."
        },
        {
            "course_code": "TRA310",
            "name": "Transport Economics",
            "learning_outcomes": "After the course, the student will:\nhave knowledge and understanding of the analytical tools used in transport economic analysis\nbe able to use the analytical tools in transport economics in the analysis of specific empirical problems\nbe able to understand the how the government can affect the transport sector through different policy instruments\nbe able to understand how transport policy and the transport system affect rest of society.",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n60%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nCalculator with empty memory + general dictionary in mother tongue/Norwegian/English in paper version\nForm of assessment:\nHome assessment with presentation\nProportion:\n40%\nDuration:\n1 semester\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Introductory course in Microeconomics"
        },
        {
            "course_code": "TRA410",
            "name": "Transport, Localization and Economic Development",
            "learning_outcomes": "You should get an understanding of how economic forces determine the localization of economic activities: businesses, trade, cities, etc. Special attention will be paid to the importance of transport and transport infrastructure as means for regional economic development, and how these economic development effects are measured. At the end of the course, you should be able to advise companies and public authorities about how transportation systems can affect economic development and location behaviour. After completion of TRA410, the student should have aquired the following:\nKnowledge\nA good overview of the theoretical foundation for location and economic development from transport infrastructure investments.\nKnowledge about the strengths and weaknesses of this analytical framework.\nIn-depth knowledge about one selected aspect or topic in which then student choose to specialize.\nSkills\nAbility to apply the theories and analytical models presented in the course to carry out case studies.\nThe student should become able to demand and utilize relevant R&D information about this topic as input for strategic planning purposes (e.g. when designing land use and transport plans.\nThe course should give a basis for advanced studies within this field.\nCompetence\nImproved analytical and writing abilities through the process of assignment writing",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n60%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material + calculator with empty memory\nForm of assessment:\nHome assessment\nProportion:\n40%\nDuration:\n1 semester\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupport material:\nAll\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:39 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Knowledge of basic microeconomics and transport economics"
        },
        {
            "course_code": "TRA610",
            "name": "Green Logistics",
            "learning_outcomes": "Knowledge:\nStudents will know the environment-related sustainability aims of the UN, and be able to discuss how transport systems and supply chains play an important role related to these aims.\nStudents will know the main elements of UN and EU regulations relevant to green logistics, an be able to analyze the impact of these regulations.\nStudents will be able to identify and analyze tools and strategies available to companies that want to make their supply chains greener.\nStudents will be able to discuss how greening supply chains and transport operations could enhance business opportunities.\nSkills:\nStudents will be able to establish a comparative analysis of emissions from supply chains and transportation cases.\nGeneral competences:\nStudents have improved their critical thinking abilities, in particular related to global sustainability challenges within logistics and transportation.",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n100%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nOnly general dictionary Mother tongue/Norwegian/English i paper format + calculator with empty memory and no communication capability\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:39 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Background knowledge equal to the content of SØK200, TRA310 and SCM110 is recommended, but not required."
        },
        {
            "course_code": "TRA705",
            "name": "Sustainable and Digitalized Urban Freight Logistics",
            "learning_outcomes": "To achieve advanced knowledge about urban freight logistics, with main emphasis on the urban freight market characteristics, planning and regulatory issues.\nThe successful candidate should have\nobtained a good overview of urban freight markets\nacquired knowledge about the regulatory and planning framework within which urban freight stakeholders operate\ndeveloped critical thinking and knowledge of the tools available to analyse and compare alternative intervention policies, estimate their likely effects with respect to current urban freight logistic systems\nachieved in-depth knowledge about selected aspect of urban freight transport and logistics through analysis of current research\nimproved his/her analytical and writing abilities through the process of assignment writing",
            "exam_format": "Form of assessment:\nWritten school assessment\nProportion:\n100%%\nDuration:\n4 Hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material + calculator with empty memory",
            "mandatory_assignments": "Mandatory coursework:\nSeminar-/collection participation\nCourseworks given:\nCourseworks required:\nPresence:\nRequired\nComment:\nActive participation in seminars is mandatory. For each seminar, a written summary and short analysis of the literature discussed at that seminar should be submitted. The submissions will be graded pass / non-pass and all have to be passed in order to take the exam.",
            "recommended_requirements": "A background in Microeconomics and Transport Economics is valuable but not mandatory."
        },
        {
            "course_code": "TRA715",
            "name": "Transport and Urban Development",
            "learning_outcomes": "After completing this course, students will:\nKnowledge\nhave an advanced knowledge of how urban transport is developed and how it operates, including specialised insight into the various transport modes, and advanced knowledge of these issues in cities in emerging economies.\nhave a thorough knowledge of certain theories in the field, such as for example policy implementation theory\nSkills\nbe able to analyze and deal critically with various sources of information about transport and urban development - particularly about the the framework conditions and instruments that affect transport behaviour in urban areas - and use them to structure and formulate scholarly arguments about how transport behaviour might be changed.\nbe capable of analyzing existing theories and interpretations in the field and work independently on applying these to practical problems faced by those working in transport planning such as, for example, the physical design of streets and buildings from a transport point of view and how this affects urban life.\nGeneral competences\nbe able to communicate about academic issues, analyses and conclusions in the field of transport and urban development, both with specialists and the general public.\nbe able to contribute to new thinking and innovation processes in the field, for example about the interaction between transport systems and urban design.",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n50%\nDuration:\n5 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nOnly general dictionary in mother tongue/Norwegian/English in paper version\nForm of assessment:\nHome assessment\nProportion:\n50%\nDuration:\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material",
            "mandatory_assignments": "Mandatory coursework:\nCourseworks given:\nCourseworks required:\nPresence:\nNot required\nComment:",
            "recommended_requirements": "No specific recommended previous knowledge"
        },
        {
            "course_code": "TRA720",
            "name": "Cost-Benefit Analysis with Applications in Transport Infrastructure",
            "learning_outcomes": "After completing the course, the student should have acquired the following:\nKnowledge\nA good overview of the theoretical foundation for cost-benefit analysis and how they are applied onto relevant transport modes.\nKnowledge about the regulatory and planning framework within which these analyses are made, with focus on current international practice.\nKnowledge about the strengths and weaknesses of this analytical framework\nIn-depth knowledge about one selected aspect or topic in which then student choose to specialise\nSkills\nAbility to apply the theories and analytical models presented in the course to carry out case studies\nCompetence\nImproved analytical and writing abilities through the process of assignment writing",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion: 7\n0%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material + calculator with empty memory\nForm of assessment:\nHome assessment\nStudents are required to prepare a semester paper and deliver an academic presentation of their work.\nProportion: 3\n0%\nDuration:\n1 semester\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupport material:\n-\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:39 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Knowledge of basic Microeconomics is recommended."
        },
        {
            "course_code": "TRA725",
            "name": "Transport Policy and Regulation",
            "learning_outcomes": "After completing the course the students will:\nKnowledge\nHave an advanced knowledge of the characteristics of infrastructure and transport provision in the context of trends over the last 50 years.\nHave a thorough knowledge and understanding of the reasons for governance, regulatory and market structures in the transport sector.\nSkills\nBe able to analyse and deal critically with policy objectives, policy instruments and market structures in the transport sector\nBe able to analyse transport policy making on different government levels, including existing theories of successful policy implementation, and policy failure.\nBe able to analyse and apply central concepts and theories related to transport policy\nGeneral competences\nBe able to communicate about academic issues, analyses and conclusions in the field, both with specialists and the general public\nDevelop skills to analyze policy proposals and advocate for their preferred options for issues on the public policy agend",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n60%\nDuration:\n5 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nOnly general dictionary in mother tongue/Norwegian/English in paper version\nForm of assessment:\nHome assessment with oral presentation\nProportion:\n40%\nDuration:\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCourseworks given:\n2\nCourseworks required:\n2\nMandatory attendance of 80 % on lectures.",
            "recommended_requirements": "As for admission to master in Sustainable Transport and Urban Mobility."
        },
        {
            "course_code": "TRA730",
            "name": "Transport Economics",
            "learning_outcomes": "After the course, the student should have obtained the following:\nKnowledge\nknowledge about transport as a service\nadvanced knowledge of the analytical tools used in economic analysis of transport systems\nknowledge about the strengths and weaknesses of different analytical methods and models.\nadvanced knowledge of how the government can affect the transport sector through different policy instruments\nunderstanding of how transport policy and the transport system affect the rest of the society.\nSkills\nbe able to analyse specific empirical problems based on theory from transport economics\nbe able to assess the effects of policy instruments applied on specific cases for the transport sector and the society at large\nbe able to pursue further studies within the field of transport economics\nGeneral competence\nbe able to discuss and acknowledge professional issues related to transport economics\nbe able to work in multi-disciplinary groups working with public sector planning that involves transport systems\nbe able to work with strategic transport analyses for public sector agencies and larger transport companies\nbe able to communicate with professional fellows and other stakeholders.",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion: 70 %\nDuration: 4 hours\nGrouping: Individual\nGrading scale: Letter (A - F)\nSupport material: Calculator that may contain data. All printed and written material.\nForm of assessment:\nHome assessment\nProportion: 30%\nDuration: 1 semester\nGrouping: group\nGrading scale: Letter (A - F)\nSupport material: All printed and written supporting material\nPLEASE NOTE that the exam form may be subjected to changes, depending on AI development and MUC's policy. Any changes will be made before the lecturing commences.",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "As for admission to MSc in Sustainable Transport and Urban Mobility. An introductory course in microeconomics is advantageous."
        },
        {
            "course_code": "TRA820",
            "name": "Air Transport Economics",
            "learning_outcomes": "This module provides an analysis of the key economic issues facing the air transport industry. The course puts special emphasis on the understanding of the air transport sector as an integrated system. After completing this module, the student should have obtained the following:\nKnowledge\nknowledge about the history of aviation\nadvanced knowledge about air transport demand and supply\nknowledge of air transport regulations and their effects\nadvanced knowledge about how airfares and aircraft capacity is determined\nknowledge about route planning within aviation\nknowledge about air transport and effects on society and environment\nSkills\nbe able to work with assessment of the viability of changes in air transport routes, airports, aircraft types\nbe able to asess how these changes affects the airlines financially\nbe able to investigate how changes in the air transport network could affect economic performance\nCompetence\nunderstand the nature of air transport and how issues can be addressed\nbe able to work in professial teams\nbe able to communicate with professionals and other stakeholders on air transoport issues,",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n60%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll written and printed material and calculator with cleared memory\nForm of assessment:\nHome assessment with oral presentation\nProportion:\n40%\nDuration:\n1 semester\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupport material:\nAll supporting material\nPLEASE NOTE that the % weights between home and school exams may change due to the College's AI policy.\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:39 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Equivalent to requirements for the MSc program in Logistics."
        },
        {
            "course_code": "TRA825",
            "name": "Sustainability in Freight Transport Chains",
            "learning_outcomes": "Knowledge:\nStudents have obtained a good overview of international freight markets of all modes of transport, with main focus on seaborne trade, and the markets for new and second-hand tonnage, including the market for demolition of vessels.\nStudents have obtained a thorough knowledge about the global and regional regulatory regime, with main emphasis on the parts relevant to transportation and the environmental performance and trade, with main focus on EU and UN regulations.\n​\nSkills:\nStudents will be able to search for relevant academic literature through the use of portals like Google Scholar.\nGeneral competences:\nStudents have improved their critical thinking abilities.\nStudents have enhanced their academic writing abilities related to the writing of an academic paper.",
            "exam_format": "Form of assessment: Essay with oral defence\nProportion:\n30%\nDuration:\n10 Weeks\nGrouping:\nGroup or individual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll supporting material\nForm of assessment:\nClosed book written school exam\nProportion:\n70%\nDuration:\n4 Hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nGeneral dictionary in Mother tongue/Norwegian/English in paper version + Calculator with empty memory\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:39 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "None beyond entry requirements for MSc Logistics."
        },
        {
            "course_code": "TRA830",
            "name": "Urban Public Transport",
            "learning_outcomes": "After the course, the student will:\nhave knowledge and understanding of the analytical tools used to analyse and evaluate public transport systems.\nbe able to use the analytical tools in the analysis of specific empirical public transport systems.\nbe able to use the analytical tools when planning public transport systems.\nbe able to understand the how the government can affect the public transport market through different policy instruments.\nbe able to understand how the public transport system affect rest of society.",
            "exam_format": "Form of assessment:\nSchool assessment\nProportion:\n60%%\nDuration:\n4 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material + calculator with empty memory\nForm of assessment:\nHome assessment\nProportion:\n40%%\nDuration:\n1 semester\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:39 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "A background in Microeconomics and Transport Economics is recommended."
        },
        {
            "course_code": "TRA835",
            "name": "Smart mobility and future transport solutions",
            "learning_outcomes": "After completing the course, the student should:\nKnowledge\nhave knowledge about some central theories and analytical perspectives that are used to gain a deeper understanding of newer perspectives on sustainable transport systems and mobility solutions.\nhave knowledge about some new research results in the field.\nSkills\nbe able to critically discuss transport planning in urban areas and its link to technology and innovative solutions.\nwork with specific cases, and through these, develop abilities to discuss and present ideas related to transport solutions for sustainable cities.\nGeneral competence\ndevelop analytical expertise across a range of topics within smart mobility",
            "exam_format": "Form of assessment:\nHome assessment\nProportion:\n60%\nDuration:\n5 hours\nGrouping:\nIndividual\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material\nForm of assessment:\nOther assessment form, describe in comment field\nProportion:\n40%\nDuration:\n1 semester\nGrouping:\nGroup\nGrading scale:\nLetter (A - F)\nSupport material:\nAll printed and written supporting material",
            "mandatory_assignments": "Mandatory coursework:\nAssignment(s)\nCourseworks given:\n1\nCourseworks required:\n1\nComment:",
            "recommended_requirements": "As for admission to master in Sustainable Transport and Urban Mobility."
        },
        {
            "course_code": "TRA904-302",
            "name": "Delivering Sustainable Transport Objectives in Barcelona",
            "learning_outcomes": "Knowledge\nTo have a well-developed awareness of the nature of transport problems as they affect a European city and city region; to know about its transport policy objectives and priorities; and to be able to catalogue the transport and related measures that the region and city are trying to put in place to achieve these objectives.\nSkills\nto understand the implementation process for transport policy measures in a western European city regional with multi-level governance structures and a mixture of policy priorities. To be able to formulate and evaluate measures that contribute to the achievement of specific transport policy objectives in a large European city.\nGeneral competences\nto develop an ability to work in a multi-cultural environment. To develop independent thinking, problem-solving and team working.",
            "exam_format": "Examination\nForm of assessment: Home assessment without presentation\nProportion: 100 %\nDuration: Submitted on the Wednesday following the week long seminar.\nGrouping: Individually\nGrading scale: Letter (A - F)\nSupport material: References provided in the coursework guidance and lectures.\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:27 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Creativity and flexibility."
        },
        {
            "course_code": "TRA950",
            "name": "Master's Degree Thesis and oral defense",
            "learning_outcomes": "After completing the Master's thesis, the student will\nKnowledge\nhave advanced knowledge within the academic field and specialized insight in a limited area\nhave thorough knowledge of the scholarly theories and methods in the field of their specific topic area\nbe able to apply knowledge to new areas within the academic field of their specific topic area\nbe able to analyze academic problems relevant to their chosen specific topic area\nSkills\nbe able to analyze and deal critically with various sources of information and use them to structure and formulate scholarly arguments\nbe able to analyze existing theories, methods and interpretations in the field\nbe able to use relevant methods for research and scholarly work and to select data collection methods in an independent manner\nbe able to carry out an independent, limited research or development project under supervision and in accordance with applicable norms for research ethics\nGeneral competencies\nBe able to analyze relevant academic, professional and research ethical problems\nBe able to apply his/her knowledge and skills in new areas in order to carry out the assignments in her/his specific topic area\nBe able to communicate extensive independent work in her/his specific topic area",
            "exam_format": "Form of assessment: Master's thesis\nProportion: 100%\nDuration: 1 Semester\nGrouping: Individual\nGrading scale: Letter (A - F)\nSupport material: All printed and written supporting material\nComment:\nSubmission of the written thesis and an oral thesis defence are required. The final grade is a combination of grades received on the thesis and the oral presentation. Only one final grade will be presented to the student.\nLast updated from FS (Felles studentsystem)\nDec. 7, 2025 11:15:27 PM",
            "mandatory_assignments": "Not specified",
            "recommended_requirements": "Only those students who are enrolled in the MSc program in Logistics can write a thesis under the TRA950 course code. In addition, each candidate must have an approved proposal that has been prepared as part of LOG904. TRA950 must be the last course taken within the MSc program, whihc means that the candidate needs to have approved 90 ECT before the master thesis is graded."
        }
    ]
}